MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1768/mcu.h
// Register: LATA
#define LATA LATA
extern volatile unsigned char           LATA                __at(0x10C);
#ifndef _LIB_BUILD
asm("LATA equ 010Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LATA0                  :1;
        unsigned LATA1                  :1;
        unsigned LATA2                  :1;
        unsigned                        :1;
        unsigned LATA4                  :1;
        unsigned LATA5                  :1;
    };
} LATAbits_t;
extern volatile LATAbits_t LATAbits __at(0x10C);
// bitfield macros
#define _LATA_LATA0_POSN                                    0x0
#define _LATA_LATA0_POSITION                                0x0
#define _LATA_LATA0_SIZE                                    0x1
#define _LATA_LATA0_LENGTH                                  0x1
#define _LATA_LATA0_MASK                                    0x1
#define _LATA_LATA1_POSN                                    0x1
#define _LATA_LATA1_POSITION                                0x1
#define _LATA_LATA1_SIZE                                    0x1
#define _LATA_LATA1_LENGTH                                  0x1
#define _LATA_LATA1_MASK                                    0x2
#define _LATA_LATA2_POSN                                    0x2
#define _LATA_LATA2_POSITION                                0x2
#define _LATA_LATA2_SIZE                                    0x1
#define _LATA_LATA2_LENGTH                                  0x1
#define _LATA_LATA2_MASK                                    0x4
#define _LATA_LATA4_POSN                                    0x4
#define _LATA_LATA4_POSITION                                0x4
#define _LATA_LATA4_SIZE                                    0x1
#define _LATA_LATA4_LENGTH                                  0x1
#define _LATA_LATA4_MASK                                    0x10
#define _LATA_LATA5_POSN                                    0x5
#define _LATA_LATA5_POSITION                                0x5
#define _LATA_LATA5_SIZE                                    0x1
#define _LATA_LATA5_LENGTH                                  0x1
#define _LATA_LATA5_MASK                                    0x20

// Register: LATB
#define LATB LATB
extern volatile unsigned char           LATB                __at(0x10D);
#ifndef _LIB_BUILD
asm("LATB equ 010Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned LATB4                  :1;
        unsigned LATB5                  :1;
        unsigned LATB6                  :1;
        unsigned LATB7                  :1;
    };
} LATBbits_t;
extern volatile LATBbits_t LATBbits __at(0x10D);
// bitfield macros
#define _LATB_LATB4_POSN                                    0x4
#define _LATB_LATB4_POSITION                                0x4
#define _LATB_LATB4_SIZE                                    0x1
#define _LATB_LATB4_LENGTH                                  0x1
#define _LATB_LATB4_MASK                                    0x10
#define _LATB_LATB5_POSN                                    0x5
#define _LATB_LATB5_POSITION                                0x5
#define _LATB_LATB5_SIZE                                    0x1
#define _LATB_LATB5_LENGTH                                  0x1
#define _LATB_LATB5_MASK                                    0x20
#define _LATB_LATB6_POSN                                    0x6
#define _LATB_LATB6_POSITION                                0x6
#define _LATB_LATB6_SIZE                                    0x1
#define _LATB_LATB6_LENGTH                                  0x1
#define _LATB_LATB6_MASK                                    0x40
#define _LATB_LATB7_POSN                                    0x7
#define _LATB_LATB7_POSITION                                0x7
#define _LATB_LATB7_SIZE                                    0x1
#define _LATB_LATB7_LENGTH                                  0x1
#define _LATB_LATB7_MASK                                    0x80

// Register: LATC
#define LATC LATC
extern volatile unsigned char           LATC                __at(0x10E);
#ifndef _LIB_BUILD
asm("LATC equ 010Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LATC0                  :1;
        unsigned LATC1                  :1;
        unsigned LATC2                  :1;
        unsigned LATC3                  :1;
        unsigned LATC4                  :1;
        unsigned LATC5                  :1;
        unsigned LATC6                  :1;
        unsigned LATC7                  :1;
    };
} LATCbits_t;
extern volatile LATCbits_t LATCbits __at(0x10E);
// bitfield macros
#define _LATC_LATC0_POSN                                    0x0
#define _LATC_LATC0_POSITION                                0x0
#define _LATC_LATC0_SIZE                                    0x1
#define _LATC_LATC0_LENGTH                                  0x1
#define _LATC_LATC0_MASK                                    0x1
#define _LATC_LATC1_POSN                                    0x1
#define _LATC_LATC1_POSITION                                0x1
#define _LATC_LATC1_SIZE                                    0x1
#define _LATC_LATC1_LENGTH                                  0x1
#define _LATC_LATC1_MASK                                    0x2
#define _LATC_LATC2_POSN                                    0x2
#define _LATC_LATC2_POSITION                                0x2
#define _LATC_LATC2_SIZE                                    0x1
#define _LATC_LATC2_LENGTH                                  0x1
#define _LATC_LATC2_MASK                                    0x4
#define _LATC_LATC3_POSN                                    0x3
#define _LATC_LATC3_POSITION                                0x3
#define _LATC_LATC3_SIZE                                    0x1
#define _LATC_LATC3_LENGTH                                  0x1
#define _LATC_LATC3_MASK                                    0x8
#define _LATC_LATC4_POSN                                    0x4
#define _LATC_LATC4_POSITION                                0x4
#define _LATC_LATC4_SIZE                                    0x1
#define _LATC_LATC4_LENGTH                                  0x1
#define _LATC_LATC4_MASK                                    0x10
#define _LATC_LATC5_POSN                                    0x5
#define _LATC_LATC5_POSITION                                0x5
#define _LATC_LATC5_SIZE                                    0x1
#define _LATC_LATC5_LENGTH                                  0x1
#define _LATC_LATC5_MASK                                    0x20
#define _LATC_LATC6_POSN                                    0x6
#define _LATC_LATC6_POSITION                                0x6
#define _LATC_LATC6_SIZE                                    0x1
#define _LATC_LATC6_LENGTH                                  0x1
#define _LATC_LATC6_MASK                                    0x40
#define _LATC_LATC7_POSN                                    0x7
#define _LATC_LATC7_POSITION                                0x7
#define _LATC_LATC7_SIZE                                    0x1
#define _LATC_LATC7_LENGTH                                  0x1
#define _LATC_LATC7_MASK                                    0x80

// Register: CMOUT
#define CMOUT CMOUT
extern volatile unsigned char           CMOUT               __at(0x10F);
#ifndef _LIB_BUILD
asm("CMOUT equ 010Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MC1OUT                 :1;
        unsigned MC2OUT                 :1;
        unsigned MC3OUT                 :1;
        unsigned MC4OUT                 :1;
    };
} CMOUTbits_t;
extern volatile CMOUTbits_t CMOUTbits __at(0x10F);
// bitfield macros
#define _CMOUT_MC1OUT_POSN                                  0x0
#define _CMOUT_MC1OUT_POSITION                              0x0
#define _CMOUT_MC1OUT_SIZE                                  0x1
#define _CMOUT_MC1OUT_LENGTH                                0x1
#define _CMOUT_MC1OUT_MASK                                  0x1
#define _CMOUT_MC2OUT_POSN                                  0x1
#define _CMOUT_MC2OUT_POSITION                              0x1
#define _CMOUT_MC2OUT_SIZE                                  0x1
#define _CMOUT_MC2OUT_LENGTH                                0x1
#define _CMOUT_MC2OUT_MASK                                  0x2
#define _CMOUT_MC3OUT_POSN                                  0x2
#define _CMOUT_MC3OUT_POSITION                              0x2
#define _CMOUT_MC3OUT_SIZE                                  0x1
#define _CMOUT_MC3OUT_LENGTH                                0x1
#define _CMOUT_MC3OUT_MASK                                  0x4
#define _CMOUT_MC4OUT_POSN                                  0x3
#define _CMOUT_MC4OUT_POSITION                              0x3
#define _CMOUT_MC4OUT_SIZE                                  0x1
#define _CMOUT_MC4OUT_LENGTH                                0x1
#define _CMOUT_MC4OUT_MASK                                  0x8

// Register: CM1CON0
#define CM1CON0 CM1CON0
extern volatile unsigned char           CM1CON0             __at(0x110);
#ifndef _LIB_BUILD
asm("CM1CON0 equ 0110h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SYNC                   :1;
        unsigned HYS                    :1;
        unsigned                        :1;
        unsigned ZLF                    :1;
        unsigned POL                    :1;
        unsigned                        :1;
        unsigned OUT                    :1;
        unsigned ON                     :1;
    };
    struct {
        unsigned C1SYNC                 :1;
        unsigned C1HYS                  :1;
        unsigned C1SP                   :1;
        unsigned C1ZLF                  :1;
        unsigned C1POL                  :1;
        unsigned                        :1;
        unsigned C1OUT                  :1;
        unsigned C1ON                   :1;
    };
} CM1CON0bits_t;
extern volatile CM1CON0bits_t CM1CON0bits __at(0x110);
// bitfield macros
#define _CM1CON0_SYNC_POSN                                  0x0
#define _CM1CON0_SYNC_POSITION                              0x0
#define _CM1CON0_SYNC_SIZE                                  0x1
#define _CM1CON0_SYNC_LENGTH                                0x1
#define _CM1CON0_SYNC_MASK                                  0x1
#define _CM1CON0_HYS_POSN                                   0x1
#define _CM1CON0_HYS_POSITION                               0x1
#define _CM1CON0_HYS_SIZE                                   0x1
#define _CM1CON0_HYS_LENGTH                                 0x1
#define _CM1CON0_HYS_MASK                                   0x2
#define _CM1CON0_ZLF_POSN                                   0x3
#define _CM1CON0_ZLF_POSITION                               0x3
#define _CM1CON0_ZLF_SIZE                                   0x1
#define _CM1CON0_ZLF_LENGTH                                 0x1
#define _CM1CON0_ZLF_MASK                                   0x8
#define _CM1CON0_POL_POSN                                   0x4
#define _CM1CON0_POL_POSITION                               0x4
#define _CM1CON0_POL_SIZE                                   0x1
#define _CM1CON0_POL_LENGTH                                 0x1
#define _CM1CON0_POL_MASK                                   0x10
#define _CM1CON0_OUT_POSN                                   0x6
#define _CM1CON0_OUT_POSITION                               0x6
#define _CM1CON0_OUT_SIZE                                   0x1
#define _CM1CON0_OUT_LENGTH                                 0x1
#define _CM1CON0_OUT_MASK                                   0x40
#define _CM1CON0_ON_POSN                                    0x7
#define _CM1CON0_ON_POSITION                                0x7
#define _CM1CON0_ON_SIZE                                    0x1
#define _CM1CON0_ON_LENGTH                                  0x1
#define _CM1CON0_ON_MASK                                    0x80
#define _CM1CON0_C1SYNC_POSN                                0x0
#define _CM1CON0_C1SYNC_POSITION                            0x0
#define _CM1CON0_C1SYNC_SIZE                                0x1
#define _CM1CON0_C1SYNC_LENGTH                              0x1
#define _CM1CON0_C1SYNC_MASK                                0x1
#define _CM1CON0_C1HYS_POSN                                 0x1
#define _CM1CON0_C1HYS_POSITION                             0x1
#define _CM1CON0_C1HYS_SIZE                                 0x1
#define _CM1CON0_C1HYS_LENGTH                               0x1
#define _CM1CON0_C1HYS_MASK                                 0x2
#define _CM1CON0_C1SP_POSN                                  0x2
#define _CM1CON0_C1SP_POSITION                              0x2
#define _CM1CON0_C1SP_SIZE                                  0x1
#define _CM1CON0_C1SP_LENGTH                                0x1
#define _CM1CON0_C1SP_MASK                                  0x4
#define _CM1CON0_C1ZLF_POSN                                 0x3
#define _CM1CON0_C1ZLF_POSITION                             0x3
#define _CM1CON0_C1ZLF_SIZE                                 0x1
#define _CM1CON0_C1ZLF_LENGTH                               0x1
#define _CM1CON0_C1ZLF_MASK                                 0x8
#define _CM1CON0_C1POL_POSN                                 0x4
#define _CM1CON0_C1POL_POSITION                             0x4
#define _CM1CON0_C1POL_SIZE                                 0x1
#define _CM1CON0_C1POL_LENGTH                               0x1
#define _CM1CON0_C1POL_MASK                                 0x10
#define _CM1CON0_C1OUT_POSN                                 0x6
#define _CM1CON0_C1OUT_POSITION                             0x6
#define _CM1CON0_C1OUT_SIZE                                 0x1
#define _CM1CON0_C1OUT_LENGTH                               0x1
#define _CM1CON0_C1OUT_MASK                                 0x40
#define _CM1CON0_C1ON_POSN                                  0x7
#define _CM1CON0_C1ON_POSITION                              0x7
#define _CM1CON0_C1ON_SIZE                                  0x1
#define _CM1CON0_C1ON_LENGTH                                0x1
#define _CM1CON0_C1ON_MASK                                  0x80

// Register: CM1CON1
#define CM1CON1 CM1CON1
extern volatile unsigned char           CM1CON1             __at(0x111);
#ifndef _LIB_BUILD
asm("CM1CON1 equ 0111h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTN                   :1;
        unsigned INTP                   :1;
    };
    struct {
        unsigned C1INTN                 :1;
        unsigned C1INTP                 :1;
    };
} CM1CON1bits_t;
extern volatile CM1CON1bits_t CM1CON1bits __at(0x111);
// bitfield macros
#define _CM1CON1_INTN_POSN                                  0x0
#define _CM1CON1_INTN_POSITION                              0x0
#define _CM1CON1_INTN_SIZE                                  0x1
#define _CM1CON1_INTN_LENGTH                                0x1
#define _CM1CON1_INTN_MASK                                  0x1
#define _CM1CON1_INTP_POSN                                  0x1
#define _CM1CON1_INTP_POSITION                              0x1
#define _CM1CON1_INTP_SIZE                                  0x1
#define _CM1CON1_INTP_LENGTH                                0x1
#define _CM1CON1_INTP_MASK                                  0x2
#define _CM1CON1_C1INTN_POSN                                0x0
#define _CM1CON1_C1INTN_POSITION                            0x0
#define _CM1CON1_C1INTN_SIZE                                0x1
#define _CM1CON1_C1INTN_LENGTH                              0x1
#define _CM1CON1_C1INTN_MASK                                0x1
#define _CM1CON1_C1INTP_POSN                                0x1
#define _CM1CON1_C1INTP_POSITION                            0x1
#define _CM1CON1_C1INTP_SIZE                                0x1
#define _CM1CON1_C1INTP_LENGTH                              0x1
#define _CM1CON1_C1INTP_MASK                                0x2

// Register: CM1NSEL
#define CM1NSEL CM1NSEL
extern volatile unsigned char           CM1NSEL             __at(0x112);
#ifndef _LIB_BUILD
asm("CM1NSEL equ 0112h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NCH                    :3;
    };
    struct {
        unsigned NCH0                   :1;
        unsigned NCH1                   :1;
        unsigned NCH2                   :1;
    };
    struct {
        unsigned C1NCH                  :3;
    };
    struct {
        unsigned C1NCH0                 :1;
        unsigned C1NCH1                 :1;
        unsigned C1NCH2                 :1;
    };
} CM1NSELbits_t;
extern volatile CM1NSELbits_t CM1NSELbits __at(0x112);
// bitfield macros
#define _CM1NSEL_NCH_POSN                                   0x0
#define _CM1NSEL_NCH_POSITION                               0x0
#define _CM1NSEL_NCH_SIZE                                   0x3
#define _CM1NSEL_NCH_LENGTH                                 0x3
#define _CM1NSEL_NCH_MASK                                   0x7
#define _CM1NSEL_NCH0_POSN                                  0x0
#define _CM1NSEL_NCH0_POSITION                              0x0
#define _CM1NSEL_NCH0_SIZE                                  0x1
#define _CM1NSEL_NCH0_LENGTH                                0x1
#define _CM1NSEL_NCH0_MASK                                  0x1
#define _CM1NSEL_NCH1_POSN                                  0x1
#define _CM1NSEL_NCH1_POSITION                              0x1
#define _CM1NSEL_NCH1_SIZE                                  0x1
#define _CM1NSEL_NCH1_LENGTH                                0x1
#define _CM1NSEL_NCH1_MASK                                  0x2
#define _CM1NSEL_NCH2_POSN                                  0x2
#define _CM1NSEL_NCH2_POSITION                              0x2
#define _CM1NSEL_NCH2_SIZE                                  0x1
#define _CM1NSEL_NCH2_LENGTH                                0x1
#define _CM1NSEL_NCH2_MASK                                  0x4
#define _CM1NSEL_C1NCH_POSN                                 0x0
#define _CM1NSEL_C1NCH_POSITION                             0x0
#define _CM1NSEL_C1NCH_SIZE                                 0x3
#define _CM1NSEL_C1NCH_LENGTH                               0x3
#define _CM1NSEL_C1NCH_MASK                                 0x7
#define _CM1NSEL_C1NCH0_POSN                                0x0
#define _CM1NSEL_C1NCH0_POSITION                            0x0
#define _CM1NSEL_C1NCH0_SIZE                                0x1
#define _CM1NSEL_C1NCH0_LENGTH                              0x1
#define _CM1NSEL_C1NCH0_MASK                                0x1
#define _CM1NSEL_C1NCH1_POSN                                0x1
#define _CM1NSEL_C1NCH1_POSITION                            0x1
#define _CM1NSEL_C1NCH1_SIZE                                0x1
#define _CM1NSEL_C1NCH1_LENGTH                              0x1
#define _CM1NSEL_C1NCH1_MASK                                0x2
#define _CM1NSEL_C1NCH2_POSN                                0x2
#define _CM1NSEL_C1NCH2_POSITION                            0x2
#define _CM1NSEL_C1NCH2_SIZE                                0x1
#define _CM1NSEL_C1NCH2_LENGTH                              0x1
#define _CM1NSEL_C1NCH2_MASK                                0x4

// Register: CM1PSEL
#define CM1PSEL CM1PSEL
extern volatile unsigned char           CM1PSEL             __at(0x113);
#ifndef _LIB_BUILD
asm("CM1PSEL equ 0113h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCH                    :4;
    };
    struct {
        unsigned PCH0                   :1;
        unsigned PCH1                   :1;
        unsigned PCH2                   :1;
        unsigned PCH3                   :1;
    };
    struct {
        unsigned C1PCH                  :4;
    };
    struct {
        unsigned C1PCH0                 :1;
        unsigned C1PCH1                 :1;
        unsigned C1PCH2                 :1;
        unsigned C1PCH3                 :1;
    };
} CM1PSELbits_t;
extern volatile CM1PSELbits_t CM1PSELbits __at(0x113);
// bitfield macros
#define _CM1PSEL_PCH_POSN                                   0x0
#define _CM1PSEL_PCH_POSITION                               0x0
#define _CM1PSEL_PCH_SIZE                                   0x4
#define _CM1PSEL_PCH_LENGTH                                 0x4
#define _CM1PSEL_PCH_MASK                                   0xF
#define _CM1PSEL_PCH0_POSN                                  0x0
#define _CM1PSEL_PCH0_POSITION                              0x0
#define _CM1PSEL_PCH0_SIZE                                  0x1
#define _CM1PSEL_PCH0_LENGTH                                0x1
#define _CM1PSEL_PCH0_MASK                                  0x1
#define _CM1PSEL_PCH1_POSN                                  0x1
#define _CM1PSEL_PCH1_POSITION                              0x1
#define _CM1PSEL_PCH1_SIZE                                  0x1
#define _CM1PSEL_PCH1_LENGTH                                0x1
#define _CM1PSEL_PCH1_MASK                                  0x2
#define _CM1PSEL_PCH2_POSN                                  0x2
#define _CM1PSEL_PCH2_POSITION                              0x2
#define _CM1PSEL_PCH2_SIZE                                  0x1
#define _CM1PSEL_PCH2_LENGTH                                0x1
#define _CM1PSEL_PCH2_MASK                                  0x4
#define _CM1PSEL_PCH3_POSN                                  0x3
#define _CM1PSEL_PCH3_POSITION                              0x3
#define _CM1PSEL_PCH3_SIZE                                  0x1
#define _CM1PSEL_PCH3_LENGTH                                0x1
#define _CM1PSEL_PCH3_MASK                                  0x8
#define _CM1PSEL_C1PCH_POSN                                 0x0
#define _CM1PSEL_C1PCH_POSITION                             0x0
#define _CM1PSEL_C1PCH_SIZE                                 0x4
#define _CM1PSEL_C1PCH_LENGTH                               0x4
#define _CM1PSEL_C1PCH_MASK                                 0xF
#define _CM1PSEL_C1PCH0_POSN                                0x0
#define _CM1PSEL_C1PCH0_POSITION                            0x0
#define _CM1PSEL_C1PCH0_SIZE                                0x1
#define _CM1PSEL_C1PCH0_LENGTH                              0x1
#define _CM1PSEL_C1PCH0_MASK                                0x1
#define _CM1PSEL_C1PCH1_POSN                                0x1
#define _CM1PSEL_C1PCH1_POSITION                            0x1
#define _CM1PSEL_C1PCH1_SIZE                                0x1
#define _CM1PSEL_C1PCH1_LENGTH                              0x1
#define _CM1PSEL_C1PCH1_MASK                                0x2
#define _CM1PSEL_C1PCH2_POSN                                0x2
#define _CM1PSEL_C1PCH2_POSITION                            0x2
#define _CM1PSEL_C1PCH2_SIZE                                0x1
#define _CM1PSEL_C1PCH2_LENGTH                              0x1
#define _CM1PSEL_C1PCH2_MASK                                0x4
#define _CM1PSEL_C1PCH3_POSN                                0x3
#define _CM1PSEL_C1PCH3_POSITION                            0x3
#define _CM1PSEL_C1PCH3_SIZE                                0x1
#define _CM1PSEL_C1PCH3_LENGTH                              0x1
#define _CM1PSEL_C1PCH3_MASK                                0x8

