MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1768/mcu.h
extern volatile CM4NSELbits_t CM4NSELbits __at(0x11E);
// bitfield macros
#define _CM4NSEL_NCH_POSN                                   0x0
#define _CM4NSEL_NCH_POSITION                               0x0
#define _CM4NSEL_NCH_SIZE                                   0x3
#define _CM4NSEL_NCH_LENGTH                                 0x3
#define _CM4NSEL_NCH_MASK                                   0x7
#define _CM4NSEL_NCH0_POSN                                  0x0
#define _CM4NSEL_NCH0_POSITION                              0x0
#define _CM4NSEL_NCH0_SIZE                                  0x1
#define _CM4NSEL_NCH0_LENGTH                                0x1
#define _CM4NSEL_NCH0_MASK                                  0x1
#define _CM4NSEL_NCH1_POSN                                  0x1
#define _CM4NSEL_NCH1_POSITION                              0x1
#define _CM4NSEL_NCH1_SIZE                                  0x1
#define _CM4NSEL_NCH1_LENGTH                                0x1
#define _CM4NSEL_NCH1_MASK                                  0x2
#define _CM4NSEL_NCH2_POSN                                  0x2
#define _CM4NSEL_NCH2_POSITION                              0x2
#define _CM4NSEL_NCH2_SIZE                                  0x1
#define _CM4NSEL_NCH2_LENGTH                                0x1
#define _CM4NSEL_NCH2_MASK                                  0x4
#define _CM4NSEL_C4NCH_POSN                                 0x0
#define _CM4NSEL_C4NCH_POSITION                             0x0
#define _CM4NSEL_C4NCH_SIZE                                 0x3
#define _CM4NSEL_C4NCH_LENGTH                               0x3
#define _CM4NSEL_C4NCH_MASK                                 0x7
#define _CM4NSEL_C4NCH0_POSN                                0x0
#define _CM4NSEL_C4NCH0_POSITION                            0x0
#define _CM4NSEL_C4NCH0_SIZE                                0x1
#define _CM4NSEL_C4NCH0_LENGTH                              0x1
#define _CM4NSEL_C4NCH0_MASK                                0x1
#define _CM4NSEL_C4NCH1_POSN                                0x1
#define _CM4NSEL_C4NCH1_POSITION                            0x1
#define _CM4NSEL_C4NCH1_SIZE                                0x1
#define _CM4NSEL_C4NCH1_LENGTH                              0x1
#define _CM4NSEL_C4NCH1_MASK                                0x2
#define _CM4NSEL_C4NCH2_POSN                                0x2
#define _CM4NSEL_C4NCH2_POSITION                            0x2
#define _CM4NSEL_C4NCH2_SIZE                                0x1
#define _CM4NSEL_C4NCH2_LENGTH                              0x1
#define _CM4NSEL_C4NCH2_MASK                                0x4

// Register: CM4PSEL
#define CM4PSEL CM4PSEL
extern volatile unsigned char           CM4PSEL             __at(0x11F);
#ifndef _LIB_BUILD
asm("CM4PSEL equ 011Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCH                    :4;
    };
    struct {
        unsigned PCH0                   :1;
        unsigned PCH1                   :1;
        unsigned PCH2                   :1;
        unsigned PCH3                   :1;
    };
    struct {
        unsigned C4PCH                  :4;
    };
    struct {
        unsigned C4PCH0                 :1;
        unsigned C4PCH1                 :1;
        unsigned C4PCH2                 :1;
        unsigned C4PCH3                 :1;
    };
} CM4PSELbits_t;
extern volatile CM4PSELbits_t CM4PSELbits __at(0x11F);
// bitfield macros
#define _CM4PSEL_PCH_POSN                                   0x0
#define _CM4PSEL_PCH_POSITION                               0x0
#define _CM4PSEL_PCH_SIZE                                   0x4
#define _CM4PSEL_PCH_LENGTH                                 0x4
#define _CM4PSEL_PCH_MASK                                   0xF
#define _CM4PSEL_PCH0_POSN                                  0x0
#define _CM4PSEL_PCH0_POSITION                              0x0
#define _CM4PSEL_PCH0_SIZE                                  0x1
#define _CM4PSEL_PCH0_LENGTH                                0x1
#define _CM4PSEL_PCH0_MASK                                  0x1
#define _CM4PSEL_PCH1_POSN                                  0x1
#define _CM4PSEL_PCH1_POSITION                              0x1
#define _CM4PSEL_PCH1_SIZE                                  0x1
#define _CM4PSEL_PCH1_LENGTH                                0x1
#define _CM4PSEL_PCH1_MASK                                  0x2
#define _CM4PSEL_PCH2_POSN                                  0x2
#define _CM4PSEL_PCH2_POSITION                              0x2
#define _CM4PSEL_PCH2_SIZE                                  0x1
#define _CM4PSEL_PCH2_LENGTH                                0x1
#define _CM4PSEL_PCH2_MASK                                  0x4
#define _CM4PSEL_PCH3_POSN                                  0x3
#define _CM4PSEL_PCH3_POSITION                              0x3
#define _CM4PSEL_PCH3_SIZE                                  0x1
#define _CM4PSEL_PCH3_LENGTH                                0x1
#define _CM4PSEL_PCH3_MASK                                  0x8
#define _CM4PSEL_C4PCH_POSN                                 0x0
#define _CM4PSEL_C4PCH_POSITION                             0x0
#define _CM4PSEL_C4PCH_SIZE                                 0x4
#define _CM4PSEL_C4PCH_LENGTH                               0x4
#define _CM4PSEL_C4PCH_MASK                                 0xF
#define _CM4PSEL_C4PCH0_POSN                                0x0
#define _CM4PSEL_C4PCH0_POSITION                            0x0
#define _CM4PSEL_C4PCH0_SIZE                                0x1
#define _CM4PSEL_C4PCH0_LENGTH                              0x1
#define _CM4PSEL_C4PCH0_MASK                                0x1
#define _CM4PSEL_C4PCH1_POSN                                0x1
#define _CM4PSEL_C4PCH1_POSITION                            0x1
#define _CM4PSEL_C4PCH1_SIZE                                0x1
#define _CM4PSEL_C4PCH1_LENGTH                              0x1
#define _CM4PSEL_C4PCH1_MASK                                0x2
#define _CM4PSEL_C4PCH2_POSN                                0x2
#define _CM4PSEL_C4PCH2_POSITION                            0x2
#define _CM4PSEL_C4PCH2_SIZE                                0x1
#define _CM4PSEL_C4PCH2_LENGTH                              0x1
#define _CM4PSEL_C4PCH2_MASK                                0x4
#define _CM4PSEL_C4PCH3_POSN                                0x3
#define _CM4PSEL_C4PCH3_POSITION                            0x3
#define _CM4PSEL_C4PCH3_SIZE                                0x1
#define _CM4PSEL_C4PCH3_LENGTH                              0x1
#define _CM4PSEL_C4PCH3_MASK                                0x8

// Register: ANSELA
#define ANSELA ANSELA
extern volatile unsigned char           ANSELA              __at(0x18C);
#ifndef _LIB_BUILD
asm("ANSELA equ 018Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSA0                  :1;
        unsigned ANSA1                  :1;
        unsigned ANSA2                  :1;
        unsigned                        :1;
        unsigned ANSA4                  :1;
    };
} ANSELAbits_t;
extern volatile ANSELAbits_t ANSELAbits __at(0x18C);
// bitfield macros
#define _ANSELA_ANSA0_POSN                                  0x0
#define _ANSELA_ANSA0_POSITION                              0x0
#define _ANSELA_ANSA0_SIZE                                  0x1
#define _ANSELA_ANSA0_LENGTH                                0x1
#define _ANSELA_ANSA0_MASK                                  0x1
#define _ANSELA_ANSA1_POSN                                  0x1
#define _ANSELA_ANSA1_POSITION                              0x1
#define _ANSELA_ANSA1_SIZE                                  0x1
#define _ANSELA_ANSA1_LENGTH                                0x1
#define _ANSELA_ANSA1_MASK                                  0x2
#define _ANSELA_ANSA2_POSN                                  0x2
#define _ANSELA_ANSA2_POSITION                              0x2
#define _ANSELA_ANSA2_SIZE                                  0x1
#define _ANSELA_ANSA2_LENGTH                                0x1
#define _ANSELA_ANSA2_MASK                                  0x4
#define _ANSELA_ANSA4_POSN                                  0x4
#define _ANSELA_ANSA4_POSITION                              0x4
#define _ANSELA_ANSA4_SIZE                                  0x1
#define _ANSELA_ANSA4_LENGTH                                0x1
#define _ANSELA_ANSA4_MASK                                  0x10

// Register: ANSELB
#define ANSELB ANSELB
extern volatile unsigned char           ANSELB              __at(0x18D);
#ifndef _LIB_BUILD
asm("ANSELB equ 018Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned ANSB4                  :1;
        unsigned ANSB5                  :1;
        unsigned ANSB6                  :1;
        unsigned ANSB7                  :1;
    };
} ANSELBbits_t;
extern volatile ANSELBbits_t ANSELBbits __at(0x18D);
// bitfield macros
#define _ANSELB_ANSB4_POSN                                  0x4
#define _ANSELB_ANSB4_POSITION                              0x4
#define _ANSELB_ANSB4_SIZE                                  0x1
#define _ANSELB_ANSB4_LENGTH                                0x1
#define _ANSELB_ANSB4_MASK                                  0x10
#define _ANSELB_ANSB5_POSN                                  0x5
#define _ANSELB_ANSB5_POSITION                              0x5
#define _ANSELB_ANSB5_SIZE                                  0x1
#define _ANSELB_ANSB5_LENGTH                                0x1
#define _ANSELB_ANSB5_MASK                                  0x20
#define _ANSELB_ANSB6_POSN                                  0x6
#define _ANSELB_ANSB6_POSITION                              0x6
#define _ANSELB_ANSB6_SIZE                                  0x1
#define _ANSELB_ANSB6_LENGTH                                0x1
#define _ANSELB_ANSB6_MASK                                  0x40
#define _ANSELB_ANSB7_POSN                                  0x7
#define _ANSELB_ANSB7_POSITION                              0x7
#define _ANSELB_ANSB7_SIZE                                  0x1
#define _ANSELB_ANSB7_LENGTH                                0x1
#define _ANSELB_ANSB7_MASK                                  0x80

// Register: ANSELC
#define ANSELC ANSELC
extern volatile unsigned char           ANSELC              __at(0x18E);
#ifndef _LIB_BUILD
asm("ANSELC equ 018Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSC0                  :1;
        unsigned ANSC1                  :1;
        unsigned ANSC2                  :1;
        unsigned ANSC3                  :1;
        unsigned                        :2;
        unsigned ANSC6                  :1;
        unsigned ANSC7                  :1;
    };
} ANSELCbits_t;
