MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1768/mcu.h
// Register: MD2CON1
#define MD2CON1 MD2CON1
extern volatile unsigned char           MD2CON1             __at(0x31C);
#ifndef _LIB_BUILD
asm("MD2CON1 equ 031Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLSYNC                 :1;
        unsigned CLPOL                  :1;
        unsigned                        :2;
        unsigned CHSYNC                 :1;
        unsigned CHPOL                  :1;
    };
    struct {
        unsigned MD2CLSYNC              :1;
        unsigned MD2CLPOL               :1;
        unsigned                        :2;
        unsigned MD2CHSYNC              :1;
        unsigned MD2CHPOL               :1;
    };
} MD2CON1bits_t;
extern volatile MD2CON1bits_t MD2CON1bits __at(0x31C);
// bitfield macros
#define _MD2CON1_CLSYNC_POSN                                0x0
#define _MD2CON1_CLSYNC_POSITION                            0x0
#define _MD2CON1_CLSYNC_SIZE                                0x1
#define _MD2CON1_CLSYNC_LENGTH                              0x1
#define _MD2CON1_CLSYNC_MASK                                0x1
#define _MD2CON1_CLPOL_POSN                                 0x1
#define _MD2CON1_CLPOL_POSITION                             0x1
#define _MD2CON1_CLPOL_SIZE                                 0x1
#define _MD2CON1_CLPOL_LENGTH                               0x1
#define _MD2CON1_CLPOL_MASK                                 0x2
#define _MD2CON1_CHSYNC_POSN                                0x4
#define _MD2CON1_CHSYNC_POSITION                            0x4
#define _MD2CON1_CHSYNC_SIZE                                0x1
#define _MD2CON1_CHSYNC_LENGTH                              0x1
#define _MD2CON1_CHSYNC_MASK                                0x10
#define _MD2CON1_CHPOL_POSN                                 0x5
#define _MD2CON1_CHPOL_POSITION                             0x5
#define _MD2CON1_CHPOL_SIZE                                 0x1
#define _MD2CON1_CHPOL_LENGTH                               0x1
#define _MD2CON1_CHPOL_MASK                                 0x20
#define _MD2CON1_MD2CLSYNC_POSN                             0x0
#define _MD2CON1_MD2CLSYNC_POSITION                         0x0
#define _MD2CON1_MD2CLSYNC_SIZE                             0x1
#define _MD2CON1_MD2CLSYNC_LENGTH                           0x1
#define _MD2CON1_MD2CLSYNC_MASK                             0x1
#define _MD2CON1_MD2CLPOL_POSN                              0x1
#define _MD2CON1_MD2CLPOL_POSITION                          0x1
#define _MD2CON1_MD2CLPOL_SIZE                              0x1
#define _MD2CON1_MD2CLPOL_LENGTH                            0x1
#define _MD2CON1_MD2CLPOL_MASK                              0x2
#define _MD2CON1_MD2CHSYNC_POSN                             0x4
#define _MD2CON1_MD2CHSYNC_POSITION                         0x4
#define _MD2CON1_MD2CHSYNC_SIZE                             0x1
#define _MD2CON1_MD2CHSYNC_LENGTH                           0x1
#define _MD2CON1_MD2CHSYNC_MASK                             0x10
#define _MD2CON1_MD2CHPOL_POSN                              0x5
#define _MD2CON1_MD2CHPOL_POSITION                          0x5
#define _MD2CON1_MD2CHPOL_SIZE                              0x1
#define _MD2CON1_MD2CHPOL_LENGTH                            0x1
#define _MD2CON1_MD2CHPOL_MASK                              0x20

// Register: MD2SRC
#define MD2SRC MD2SRC
extern volatile unsigned char           MD2SRC              __at(0x31D);
#ifndef _LIB_BUILD
asm("MD2SRC equ 031Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MS                     :5;
    };
    struct {
        unsigned MS0                    :1;
        unsigned MS1                    :1;
        unsigned MS2                    :1;
        unsigned MS3                    :1;
        unsigned MS4                    :1;
    };
    struct {
        unsigned MD2MS                  :5;
    };
    struct {
        unsigned MD2MS0                 :1;
        unsigned MD2MS1                 :1;
        unsigned MD2MS2                 :1;
        unsigned MD2MS3                 :1;
        unsigned MD2MS4                 :1;
    };
} MD2SRCbits_t;
extern volatile MD2SRCbits_t MD2SRCbits __at(0x31D);
// bitfield macros
#define _MD2SRC_MS_POSN                                     0x0
#define _MD2SRC_MS_POSITION                                 0x0
#define _MD2SRC_MS_SIZE                                     0x5
#define _MD2SRC_MS_LENGTH                                   0x5
#define _MD2SRC_MS_MASK                                     0x1F
#define _MD2SRC_MS0_POSN                                    0x0
#define _MD2SRC_MS0_POSITION                                0x0
#define _MD2SRC_MS0_SIZE                                    0x1
#define _MD2SRC_MS0_LENGTH                                  0x1
#define _MD2SRC_MS0_MASK                                    0x1
#define _MD2SRC_MS1_POSN                                    0x1
#define _MD2SRC_MS1_POSITION                                0x1
#define _MD2SRC_MS1_SIZE                                    0x1
#define _MD2SRC_MS1_LENGTH                                  0x1
#define _MD2SRC_MS1_MASK                                    0x2
#define _MD2SRC_MS2_POSN                                    0x2
#define _MD2SRC_MS2_POSITION                                0x2
#define _MD2SRC_MS2_SIZE                                    0x1
#define _MD2SRC_MS2_LENGTH                                  0x1
#define _MD2SRC_MS2_MASK                                    0x4
#define _MD2SRC_MS3_POSN                                    0x3
#define _MD2SRC_MS3_POSITION                                0x3
#define _MD2SRC_MS3_SIZE                                    0x1
#define _MD2SRC_MS3_LENGTH                                  0x1
#define _MD2SRC_MS3_MASK                                    0x8
#define _MD2SRC_MS4_POSN                                    0x4
#define _MD2SRC_MS4_POSITION                                0x4
#define _MD2SRC_MS4_SIZE                                    0x1
#define _MD2SRC_MS4_LENGTH                                  0x1
#define _MD2SRC_MS4_MASK                                    0x10
#define _MD2SRC_MD2MS_POSN                                  0x0
#define _MD2SRC_MD2MS_POSITION                              0x0
#define _MD2SRC_MD2MS_SIZE                                  0x5
#define _MD2SRC_MD2MS_LENGTH                                0x5
#define _MD2SRC_MD2MS_MASK                                  0x1F
#define _MD2SRC_MD2MS0_POSN                                 0x0
#define _MD2SRC_MD2MS0_POSITION                             0x0
#define _MD2SRC_MD2MS0_SIZE                                 0x1
#define _MD2SRC_MD2MS0_LENGTH                               0x1
#define _MD2SRC_MD2MS0_MASK                                 0x1
#define _MD2SRC_MD2MS1_POSN                                 0x1
#define _MD2SRC_MD2MS1_POSITION                             0x1
#define _MD2SRC_MD2MS1_SIZE                                 0x1
#define _MD2SRC_MD2MS1_LENGTH                               0x1
#define _MD2SRC_MD2MS1_MASK                                 0x2
#define _MD2SRC_MD2MS2_POSN                                 0x2
#define _MD2SRC_MD2MS2_POSITION                             0x2
#define _MD2SRC_MD2MS2_SIZE                                 0x1
#define _MD2SRC_MD2MS2_LENGTH                               0x1
#define _MD2SRC_MD2MS2_MASK                                 0x4
#define _MD2SRC_MD2MS3_POSN                                 0x3
#define _MD2SRC_MD2MS3_POSITION                             0x3
#define _MD2SRC_MD2MS3_SIZE                                 0x1
#define _MD2SRC_MD2MS3_LENGTH                               0x1
#define _MD2SRC_MD2MS3_MASK                                 0x8
#define _MD2SRC_MD2MS4_POSN                                 0x4
#define _MD2SRC_MD2MS4_POSITION                             0x4
#define _MD2SRC_MD2MS4_SIZE                                 0x1
#define _MD2SRC_MD2MS4_LENGTH                               0x1
#define _MD2SRC_MD2MS4_MASK                                 0x10

// Register: MD2CARL
#define MD2CARL MD2CARL
extern volatile unsigned char           MD2CARL             __at(0x31E);
#ifndef _LIB_BUILD
asm("MD2CARL equ 031Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CL                     :4;
    };
    struct {
        unsigned CL0                    :1;
        unsigned CL1                    :1;
        unsigned CL2                    :1;
        unsigned CL3                    :1;
    };
    struct {
        unsigned MD2CL                  :4;
    };
    struct {
        unsigned MD2CL0                 :1;
        unsigned MD2CL1                 :1;
        unsigned MD2CL2                 :1;
        unsigned MD2CL3                 :1;
    };
} MD2CARLbits_t;
extern volatile MD2CARLbits_t MD2CARLbits __at(0x31E);
// bitfield macros
#define _MD2CARL_CL_POSN                                    0x0
#define _MD2CARL_CL_POSITION                                0x0
#define _MD2CARL_CL_SIZE                                    0x4
#define _MD2CARL_CL_LENGTH                                  0x4
#define _MD2CARL_CL_MASK                                    0xF
#define _MD2CARL_CL0_POSN                                   0x0
#define _MD2CARL_CL0_POSITION                               0x0
#define _MD2CARL_CL0_SIZE                                   0x1
#define _MD2CARL_CL0_LENGTH                                 0x1
#define _MD2CARL_CL0_MASK                                   0x1
#define _MD2CARL_CL1_POSN                                   0x1
#define _MD2CARL_CL1_POSITION                               0x1
#define _MD2CARL_CL1_SIZE                                   0x1
#define _MD2CARL_CL1_LENGTH                                 0x1
#define _MD2CARL_CL1_MASK                                   0x2
#define _MD2CARL_CL2_POSN                                   0x2
#define _MD2CARL_CL2_POSITION                               0x2
#define _MD2CARL_CL2_SIZE                                   0x1
#define _MD2CARL_CL2_LENGTH                                 0x1
#define _MD2CARL_CL2_MASK                                   0x4
#define _MD2CARL_CL3_POSN                                   0x3
#define _MD2CARL_CL3_POSITION                               0x3
#define _MD2CARL_CL3_SIZE                                   0x1
#define _MD2CARL_CL3_LENGTH                                 0x1
#define _MD2CARL_CL3_MASK                                   0x8
#define _MD2CARL_MD2CL_POSN                                 0x0
#define _MD2CARL_MD2CL_POSITION                             0x0
#define _MD2CARL_MD2CL_SIZE                                 0x4
#define _MD2CARL_MD2CL_LENGTH                               0x4
#define _MD2CARL_MD2CL_MASK                                 0xF
#define _MD2CARL_MD2CL0_POSN                                0x0
#define _MD2CARL_MD2CL0_POSITION                            0x0
#define _MD2CARL_MD2CL0_SIZE                                0x1
#define _MD2CARL_MD2CL0_LENGTH                              0x1
#define _MD2CARL_MD2CL0_MASK                                0x1
#define _MD2CARL_MD2CL1_POSN                                0x1
#define _MD2CARL_MD2CL1_POSITION                            0x1
#define _MD2CARL_MD2CL1_SIZE                                0x1
#define _MD2CARL_MD2CL1_LENGTH                              0x1
#define _MD2CARL_MD2CL1_MASK                                0x2
#define _MD2CARL_MD2CL2_POSN                                0x2
#define _MD2CARL_MD2CL2_POSITION                            0x2
#define _MD2CARL_MD2CL2_SIZE                                0x1
#define _MD2CARL_MD2CL2_LENGTH                              0x1
#define _MD2CARL_MD2CL2_MASK                                0x4
#define _MD2CARL_MD2CL3_POSN                                0x3
#define _MD2CARL_MD2CL3_POSITION                            0x3
#define _MD2CARL_MD2CL3_SIZE                                0x1
#define _MD2CARL_MD2CL3_LENGTH                              0x1
#define _MD2CARL_MD2CL3_MASK                                0x8

// Register: MD2CARH
#define MD2CARH MD2CARH
extern volatile unsigned char           MD2CARH             __at(0x31F);
#ifndef _LIB_BUILD
asm("MD2CARH equ 031Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CH                     :4;
    };
    struct {
        unsigned CH0                    :1;
        unsigned CH1                    :1;
        unsigned CH2                    :1;
        unsigned CH3                    :1;
    };
    struct {
        unsigned MD2CH                  :4;
    };
    struct {
        unsigned MD2CH0                 :1;
        unsigned MD2CH1                 :1;
        unsigned MD2CH2                 :1;
        unsigned MD2CH3                 :1;
    };
} MD2CARHbits_t;
