MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1768/mcu.h
// Register: TMR3H
#define TMR3H TMR3H
extern volatile unsigned char           TMR3H               __at(0x494);
#ifndef _LIB_BUILD
asm("TMR3H equ 0494h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
} TMR3Hbits_t;
extern volatile TMR3Hbits_t TMR3Hbits __at(0x494);
// bitfield macros
#define _TMR3H_TMR_POSN                                     0x0
#define _TMR3H_TMR_POSITION                                 0x0
#define _TMR3H_TMR_SIZE                                     0x8
#define _TMR3H_TMR_LENGTH                                   0x8
#define _TMR3H_TMR_MASK                                     0xFF

// Register: T3CON
#define T3CON T3CON
extern volatile unsigned char           T3CON               __at(0x495);
#ifndef _LIB_BUILD
asm("T3CON equ 0495h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ON                     :1;
        unsigned                        :1;
        unsigned nSYNC                  :1;
        unsigned                        :1;
        unsigned CKPS                   :2;
        unsigned CS                     :2;
    };
    struct {
        unsigned TMRON                  :1;
        unsigned                        :1;
        unsigned SYNC                   :1;
        unsigned                        :1;
        unsigned CKPS0                  :1;
        unsigned CKPS1                  :1;
        unsigned CS0                    :1;
        unsigned CS1                    :1;
    };
    struct {
        unsigned TMR3ON                 :1;
        unsigned                        :1;
        unsigned nT3SYNC                :1;
        unsigned                        :3;
        unsigned T3CS0                  :1;
        unsigned T3CS1                  :1;
    };
    struct {
        unsigned T3ON                   :1;
        unsigned                        :3;
        unsigned T3CKPS0                :1;
        unsigned T3CKPS1                :1;
        unsigned TMR3CS0                :1;
        unsigned TMR3CS1                :1;
    };
} T3CONbits_t;
extern volatile T3CONbits_t T3CONbits __at(0x495);
// bitfield macros
#define _T3CON_ON_POSN                                      0x0
#define _T3CON_ON_POSITION                                  0x0
#define _T3CON_ON_SIZE                                      0x1
#define _T3CON_ON_LENGTH                                    0x1
#define _T3CON_ON_MASK                                      0x1
#define _T3CON_nSYNC_POSN                                   0x2
#define _T3CON_nSYNC_POSITION                               0x2
#define _T3CON_nSYNC_SIZE                                   0x1
#define _T3CON_nSYNC_LENGTH                                 0x1
#define _T3CON_nSYNC_MASK                                   0x4
#define _T3CON_CKPS_POSN                                    0x4
#define _T3CON_CKPS_POSITION                                0x4
#define _T3CON_CKPS_SIZE                                    0x2
#define _T3CON_CKPS_LENGTH                                  0x2
#define _T3CON_CKPS_MASK                                    0x30
#define _T3CON_CS_POSN                                      0x6
#define _T3CON_CS_POSITION                                  0x6
#define _T3CON_CS_SIZE                                      0x2
#define _T3CON_CS_LENGTH                                    0x2
#define _T3CON_CS_MASK                                      0xC0
#define _T3CON_TMRON_POSN                                   0x0
#define _T3CON_TMRON_POSITION                               0x0
#define _T3CON_TMRON_SIZE                                   0x1
#define _T3CON_TMRON_LENGTH                                 0x1
#define _T3CON_TMRON_MASK                                   0x1
#define _T3CON_SYNC_POSN                                    0x2
#define _T3CON_SYNC_POSITION                                0x2
#define _T3CON_SYNC_SIZE                                    0x1
#define _T3CON_SYNC_LENGTH                                  0x1
#define _T3CON_SYNC_MASK                                    0x4
#define _T3CON_CKPS0_POSN                                   0x4
#define _T3CON_CKPS0_POSITION                               0x4
#define _T3CON_CKPS0_SIZE                                   0x1
#define _T3CON_CKPS0_LENGTH                                 0x1
#define _T3CON_CKPS0_MASK                                   0x10
#define _T3CON_CKPS1_POSN                                   0x5
#define _T3CON_CKPS1_POSITION                               0x5
#define _T3CON_CKPS1_SIZE                                   0x1
#define _T3CON_CKPS1_LENGTH                                 0x1
#define _T3CON_CKPS1_MASK                                   0x20
#define _T3CON_CS0_POSN                                     0x6
#define _T3CON_CS0_POSITION                                 0x6
#define _T3CON_CS0_SIZE                                     0x1
#define _T3CON_CS0_LENGTH                                   0x1
#define _T3CON_CS0_MASK                                     0x40
#define _T3CON_CS1_POSN                                     0x7
#define _T3CON_CS1_POSITION                                 0x7
#define _T3CON_CS1_SIZE                                     0x1
#define _T3CON_CS1_LENGTH                                   0x1
#define _T3CON_CS1_MASK                                     0x80
#define _T3CON_TMR3ON_POSN                                  0x0
#define _T3CON_TMR3ON_POSITION                              0x0
#define _T3CON_TMR3ON_SIZE                                  0x1
#define _T3CON_TMR3ON_LENGTH                                0x1
#define _T3CON_TMR3ON_MASK                                  0x1
#define _T3CON_nT3SYNC_POSN                                 0x2
#define _T3CON_nT3SYNC_POSITION                             0x2
#define _T3CON_nT3SYNC_SIZE                                 0x1
#define _T3CON_nT3SYNC_LENGTH                               0x1
#define _T3CON_nT3SYNC_MASK                                 0x4
#define _T3CON_T3CS0_POSN                                   0x6
#define _T3CON_T3CS0_POSITION                               0x6
#define _T3CON_T3CS0_SIZE                                   0x1
#define _T3CON_T3CS0_LENGTH                                 0x1
#define _T3CON_T3CS0_MASK                                   0x40
#define _T3CON_T3CS1_POSN                                   0x7
#define _T3CON_T3CS1_POSITION                               0x7
#define _T3CON_T3CS1_SIZE                                   0x1
#define _T3CON_T3CS1_LENGTH                                 0x1
#define _T3CON_T3CS1_MASK                                   0x80
#define _T3CON_T3ON_POSN                                    0x0
#define _T3CON_T3ON_POSITION                                0x0
#define _T3CON_T3ON_SIZE                                    0x1
#define _T3CON_T3ON_LENGTH                                  0x1
#define _T3CON_T3ON_MASK                                    0x1
#define _T3CON_T3CKPS0_POSN                                 0x4
#define _T3CON_T3CKPS0_POSITION                             0x4
#define _T3CON_T3CKPS0_SIZE                                 0x1
#define _T3CON_T3CKPS0_LENGTH                               0x1
#define _T3CON_T3CKPS0_MASK                                 0x10
#define _T3CON_T3CKPS1_POSN                                 0x5
#define _T3CON_T3CKPS1_POSITION                             0x5
#define _T3CON_T3CKPS1_SIZE                                 0x1
#define _T3CON_T3CKPS1_LENGTH                               0x1
#define _T3CON_T3CKPS1_MASK                                 0x20
#define _T3CON_TMR3CS0_POSN                                 0x6
#define _T3CON_TMR3CS0_POSITION                             0x6
#define _T3CON_TMR3CS0_SIZE                                 0x1
#define _T3CON_TMR3CS0_LENGTH                               0x1
#define _T3CON_TMR3CS0_MASK                                 0x40
#define _T3CON_TMR3CS1_POSN                                 0x7
#define _T3CON_TMR3CS1_POSITION                             0x7
#define _T3CON_TMR3CS1_SIZE                                 0x1
#define _T3CON_TMR3CS1_LENGTH                               0x1
#define _T3CON_TMR3CS1_MASK                                 0x80

// Register: T3GCON
#define T3GCON T3GCON
extern volatile unsigned char           T3GCON              __at(0x496);
#ifndef _LIB_BUILD
asm("T3GCON equ 0496h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned GSS                    :2;
        unsigned GVAL                   :1;
        unsigned GGO_nDONE              :1;
        unsigned GSPM                   :1;
        unsigned GTM                    :1;
        unsigned GPOL                   :1;
        unsigned GE                     :1;
    };
    struct {
        unsigned GSS0                   :1;
        unsigned GSS1                   :1;
        unsigned                        :5;
        unsigned T3GE                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned T3GVAL                 :1;
        unsigned T3GGO_nDONE            :1;
        unsigned T3GSPM                 :1;
        unsigned T3GTM                  :1;
        unsigned T3GPOL                 :1;
        unsigned TMR3GE                 :1;
    };
    struct {
        unsigned T3GSS0                 :1;
        unsigned T3GSS1                 :1;
    };
} T3GCONbits_t;
