MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1768/mcu.h
// Register: OPA1CON
#define OPA1CON OPA1CON
extern volatile unsigned char           OPA1CON             __at(0x511);
#ifndef _LIB_BUILD
asm("OPA1CON equ 0511h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ORM                    :2;
        unsigned ORPOL                  :1;
        unsigned                        :1;
        unsigned UG                     :1;
        unsigned                        :2;
        unsigned EN                     :1;
    };
    struct {
        unsigned ORM0                   :1;
        unsigned ORM1                   :1;
    };
    struct {
        unsigned OPA1ORM                :2;
        unsigned OPA1ORPOL              :1;
        unsigned                        :1;
        unsigned OPA1UG                 :1;
        unsigned                        :2;
        unsigned OPA1EN                 :1;
    };
    struct {
        unsigned OPA1ORM0               :1;
        unsigned OPA1ORM1               :1;
    };
} OPA1CONbits_t;
extern volatile OPA1CONbits_t OPA1CONbits __at(0x511);
// bitfield macros
#define _OPA1CON_ORM_POSN                                   0x0
#define _OPA1CON_ORM_POSITION                               0x0
#define _OPA1CON_ORM_SIZE                                   0x2
#define _OPA1CON_ORM_LENGTH                                 0x2
#define _OPA1CON_ORM_MASK                                   0x3
#define _OPA1CON_ORPOL_POSN                                 0x2
#define _OPA1CON_ORPOL_POSITION                             0x2
#define _OPA1CON_ORPOL_SIZE                                 0x1
#define _OPA1CON_ORPOL_LENGTH                               0x1
#define _OPA1CON_ORPOL_MASK                                 0x4
#define _OPA1CON_UG_POSN                                    0x4
#define _OPA1CON_UG_POSITION                                0x4
#define _OPA1CON_UG_SIZE                                    0x1
#define _OPA1CON_UG_LENGTH                                  0x1
#define _OPA1CON_UG_MASK                                    0x10
#define _OPA1CON_EN_POSN                                    0x7
#define _OPA1CON_EN_POSITION                                0x7
#define _OPA1CON_EN_SIZE                                    0x1
#define _OPA1CON_EN_LENGTH                                  0x1
#define _OPA1CON_EN_MASK                                    0x80
#define _OPA1CON_ORM0_POSN                                  0x0
#define _OPA1CON_ORM0_POSITION                              0x0
#define _OPA1CON_ORM0_SIZE                                  0x1
#define _OPA1CON_ORM0_LENGTH                                0x1
#define _OPA1CON_ORM0_MASK                                  0x1
#define _OPA1CON_ORM1_POSN                                  0x1
#define _OPA1CON_ORM1_POSITION                              0x1
#define _OPA1CON_ORM1_SIZE                                  0x1
#define _OPA1CON_ORM1_LENGTH                                0x1
#define _OPA1CON_ORM1_MASK                                  0x2
#define _OPA1CON_OPA1ORM_POSN                               0x0
#define _OPA1CON_OPA1ORM_POSITION                           0x0
#define _OPA1CON_OPA1ORM_SIZE                               0x2
#define _OPA1CON_OPA1ORM_LENGTH                             0x2
#define _OPA1CON_OPA1ORM_MASK                               0x3
#define _OPA1CON_OPA1ORPOL_POSN                             0x2
#define _OPA1CON_OPA1ORPOL_POSITION                         0x2
#define _OPA1CON_OPA1ORPOL_SIZE                             0x1
#define _OPA1CON_OPA1ORPOL_LENGTH                           0x1
#define _OPA1CON_OPA1ORPOL_MASK                             0x4
#define _OPA1CON_OPA1UG_POSN                                0x4
#define _OPA1CON_OPA1UG_POSITION                            0x4
#define _OPA1CON_OPA1UG_SIZE                                0x1
#define _OPA1CON_OPA1UG_LENGTH                              0x1
#define _OPA1CON_OPA1UG_MASK                                0x10
#define _OPA1CON_OPA1EN_POSN                                0x7
#define _OPA1CON_OPA1EN_POSITION                            0x7
#define _OPA1CON_OPA1EN_SIZE                                0x1
#define _OPA1CON_OPA1EN_LENGTH                              0x1
#define _OPA1CON_OPA1EN_MASK                                0x80
#define _OPA1CON_OPA1ORM0_POSN                              0x0
#define _OPA1CON_OPA1ORM0_POSITION                          0x0
#define _OPA1CON_OPA1ORM0_SIZE                              0x1
#define _OPA1CON_OPA1ORM0_LENGTH                            0x1
#define _OPA1CON_OPA1ORM0_MASK                              0x1
#define _OPA1CON_OPA1ORM1_POSN                              0x1
#define _OPA1CON_OPA1ORM1_POSITION                          0x1
#define _OPA1CON_OPA1ORM1_SIZE                              0x1
#define _OPA1CON_OPA1ORM1_LENGTH                            0x1
#define _OPA1CON_OPA1ORM1_MASK                              0x2

// Register: OPA1ORS
#define OPA1ORS OPA1ORS
extern volatile unsigned char           OPA1ORS             __at(0x512);
#ifndef _LIB_BUILD
asm("OPA1ORS equ 0512h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ORS                    :8;
    };
} OPA1ORSbits_t;
extern volatile OPA1ORSbits_t OPA1ORSbits __at(0x512);
// bitfield macros
#define _OPA1ORS_ORS_POSN                                   0x0
#define _OPA1ORS_ORS_POSITION                               0x0
#define _OPA1ORS_ORS_SIZE                                   0x8
#define _OPA1ORS_ORS_LENGTH                                 0x8
#define _OPA1ORS_ORS_MASK                                   0xFF

// Register: OPA2NCHS
#define OPA2NCHS OPA2NCHS
extern volatile unsigned char           OPA2NCHS            __at(0x513);
#ifndef _LIB_BUILD
asm("OPA2NCHS equ 0513h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NCH                    :8;
    };
    struct {
        unsigned OPA2NCH                :8;
    };
} OPA2NCHSbits_t;
extern volatile OPA2NCHSbits_t OPA2NCHSbits __at(0x513);
// bitfield macros
#define _OPA2NCHS_NCH_POSN                                  0x0
#define _OPA2NCHS_NCH_POSITION                              0x0
#define _OPA2NCHS_NCH_SIZE                                  0x8
#define _OPA2NCHS_NCH_LENGTH                                0x8
#define _OPA2NCHS_NCH_MASK                                  0xFF
#define _OPA2NCHS_OPA2NCH_POSN                              0x0
#define _OPA2NCHS_OPA2NCH_POSITION                          0x0
#define _OPA2NCHS_OPA2NCH_SIZE                              0x8
#define _OPA2NCHS_OPA2NCH_LENGTH                            0x8
#define _OPA2NCHS_OPA2NCH_MASK                              0xFF

// Register: OPA2PCHS
#define OPA2PCHS OPA2PCHS
extern volatile unsigned char           OPA2PCHS            __at(0x514);
#ifndef _LIB_BUILD
asm("OPA2PCHS equ 0514h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCH                    :8;
    };
    struct {
        unsigned OPA2PCH                :8;
    };
} OPA2PCHSbits_t;
extern volatile OPA2PCHSbits_t OPA2PCHSbits __at(0x514);
// bitfield macros
#define _OPA2PCHS_PCH_POSN                                  0x0
#define _OPA2PCHS_PCH_POSITION                              0x0
#define _OPA2PCHS_PCH_SIZE                                  0x8
#define _OPA2PCHS_PCH_LENGTH                                0x8
#define _OPA2PCHS_PCH_MASK                                  0xFF
#define _OPA2PCHS_OPA2PCH_POSN                              0x0
#define _OPA2PCHS_OPA2PCH_POSITION                          0x0
#define _OPA2PCHS_OPA2PCH_SIZE                              0x8
#define _OPA2PCHS_OPA2PCH_LENGTH                            0x8
#define _OPA2PCHS_OPA2PCH_MASK                              0xFF

// Register: OPA2CON
#define OPA2CON OPA2CON
extern volatile unsigned char           OPA2CON             __at(0x515);
#ifndef _LIB_BUILD
asm("OPA2CON equ 0515h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ORM                    :2;
        unsigned ORPOL                  :1;
        unsigned                        :1;
        unsigned UG                     :1;
        unsigned                        :2;
        unsigned EN                     :1;
    };
    struct {
        unsigned ORM0                   :1;
        unsigned ORM1                   :1;
    };
    struct {
        unsigned OPA2ORM                :2;
        unsigned OPA2ORPOL              :1;
        unsigned                        :1;
        unsigned OPA2UG                 :1;
        unsigned                        :2;
        unsigned OPA2EN                 :1;
    };
    struct {
        unsigned OPA2ORM0               :1;
        unsigned OPA2ORM1               :1;
    };
} OPA2CONbits_t;
extern volatile OPA2CONbits_t OPA2CONbits __at(0x515);
// bitfield macros
#define _OPA2CON_ORM_POSN                                   0x0
#define _OPA2CON_ORM_POSITION                               0x0
#define _OPA2CON_ORM_SIZE                                   0x2
#define _OPA2CON_ORM_LENGTH                                 0x2
#define _OPA2CON_ORM_MASK                                   0x3
#define _OPA2CON_ORPOL_POSN                                 0x2
#define _OPA2CON_ORPOL_POSITION                             0x2
#define _OPA2CON_ORPOL_SIZE                                 0x1
#define _OPA2CON_ORPOL_LENGTH                               0x1
#define _OPA2CON_ORPOL_MASK                                 0x4
#define _OPA2CON_UG_POSN                                    0x4
#define _OPA2CON_UG_POSITION                                0x4
#define _OPA2CON_UG_SIZE                                    0x1
#define _OPA2CON_UG_LENGTH                                  0x1
#define _OPA2CON_UG_MASK                                    0x10
#define _OPA2CON_EN_POSN                                    0x7
#define _OPA2CON_EN_POSITION                                0x7
#define _OPA2CON_EN_SIZE                                    0x1
#define _OPA2CON_EN_LENGTH                                  0x1
#define _OPA2CON_EN_MASK                                    0x80
#define _OPA2CON_ORM0_POSN                                  0x0
#define _OPA2CON_ORM0_POSITION                              0x0
#define _OPA2CON_ORM0_SIZE                                  0x1
#define _OPA2CON_ORM0_LENGTH                                0x1
#define _OPA2CON_ORM0_MASK                                  0x1
#define _OPA2CON_ORM1_POSN                                  0x1
#define _OPA2CON_ORM1_POSITION                              0x1
#define _OPA2CON_ORM1_SIZE                                  0x1
#define _OPA2CON_ORM1_LENGTH                                0x1
#define _OPA2CON_ORM1_MASK                                  0x2
#define _OPA2CON_OPA2ORM_POSN                               0x0
#define _OPA2CON_OPA2ORM_POSITION                           0x0
#define _OPA2CON_OPA2ORM_SIZE                               0x2
#define _OPA2CON_OPA2ORM_LENGTH                             0x2
#define _OPA2CON_OPA2ORM_MASK                               0x3
#define _OPA2CON_OPA2ORPOL_POSN                             0x2
#define _OPA2CON_OPA2ORPOL_POSITION                         0x2
#define _OPA2CON_OPA2ORPOL_SIZE                             0x1
#define _OPA2CON_OPA2ORPOL_LENGTH                           0x1
#define _OPA2CON_OPA2ORPOL_MASK                             0x4
#define _OPA2CON_OPA2UG_POSN                                0x4
#define _OPA2CON_OPA2UG_POSITION                            0x4
#define _OPA2CON_OPA2UG_SIZE                                0x1
#define _OPA2CON_OPA2UG_LENGTH                              0x1
#define _OPA2CON_OPA2UG_MASK                                0x10
#define _OPA2CON_OPA2EN_POSN                                0x7
#define _OPA2CON_OPA2EN_POSITION                            0x7
#define _OPA2CON_OPA2EN_SIZE                                0x1
#define _OPA2CON_OPA2EN_LENGTH                              0x1
#define _OPA2CON_OPA2EN_MASK                                0x80
#define _OPA2CON_OPA2ORM0_POSN                              0x0
#define _OPA2CON_OPA2ORM0_POSITION                          0x0
#define _OPA2CON_OPA2ORM0_SIZE                              0x1
#define _OPA2CON_OPA2ORM0_LENGTH                            0x1
#define _OPA2CON_OPA2ORM0_MASK                              0x1
#define _OPA2CON_OPA2ORM1_POSN                              0x1
#define _OPA2CON_OPA2ORM1_POSITION                          0x1
#define _OPA2CON_OPA2ORM1_SIZE                              0x1
#define _OPA2CON_OPA2ORM1_LENGTH                            0x1
#define _OPA2CON_OPA2ORM1_MASK                              0x2

// Register: OPA2ORS
#define OPA2ORS OPA2ORS
extern volatile unsigned char           OPA2ORS             __at(0x516);
#ifndef _LIB_BUILD
asm("OPA2ORS equ 0516h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ORS                    :8;
    };
} OPA2ORSbits_t;
extern volatile OPA2ORSbits_t OPA2ORSbits __at(0x516);
// bitfield macros
#define _OPA2ORS_ORS_POSN                                   0x0
#define _OPA2ORS_ORS_POSITION                               0x0
#define _OPA2ORS_ORS_SIZE                                   0x8
#define _OPA2ORS_ORS_LENGTH                                 0x8
#define _OPA2ORS_ORS_MASK                                   0xFF

// Register: DACLD
#define DACLD DACLD
extern volatile unsigned char           DACLD               __at(0x590);
#ifndef _LIB_BUILD
asm("DACLD equ 0590h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DAC1LD                 :1;
        unsigned DAC2LD                 :1;
    };
} DACLDbits_t;
extern volatile DACLDbits_t DACLDbits __at(0x590);
// bitfield macros
#define _DACLD_DAC1LD_POSN                                  0x0
#define _DACLD_DAC1LD_POSITION                              0x0
#define _DACLD_DAC1LD_SIZE                                  0x1
#define _DACLD_DAC1LD_LENGTH                                0x1
#define _DACLD_DAC1LD_MASK                                  0x1
#define _DACLD_DAC2LD_POSN                                  0x1
#define _DACLD_DAC2LD_POSITION                              0x1
#define _DACLD_DAC2LD_SIZE                                  0x1
#define _DACLD_DAC2LD_LENGTH                                0x1
#define _DACLD_DAC2LD_MASK                                  0x2

// Register: DAC1CON0
#define DAC1CON0 DAC1CON0
extern volatile unsigned char           DAC1CON0            __at(0x591);
#ifndef _LIB_BUILD
asm("DAC1CON0 equ 0591h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NSS                    :2;
        unsigned PSS                    :2;
        unsigned                        :1;
        unsigned OE1                    :1;
        unsigned FM                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned NSS0                   :1;
        unsigned                        :1;
        unsigned PSS0                   :1;
        unsigned PSS1                   :1;
        unsigned                        :1;
        unsigned OE                     :1;
    };
    struct {
        unsigned DACNSS                 :2;
        unsigned DACPSS                 :2;
        unsigned                        :1;
        unsigned DACOE1                 :1;
        unsigned DACFM                  :1;
        unsigned DACEN                  :1;
    };
    struct {
        unsigned DACNSS0                :1;
        unsigned                        :1;
        unsigned DACPSS0                :1;
        unsigned DACPSS1                :1;
        unsigned                        :1;
        unsigned DACOE                  :1;
    };
    struct {
        unsigned DAC1NSS                :2;
        unsigned DAC1PSS                :2;
        unsigned                        :1;
        unsigned DAC1OE1                :1;
        unsigned DAC1FM                 :1;
        unsigned DAC1EN                 :1;
    };
    struct {
        unsigned DAC1NSS0               :1;
        unsigned                        :1;
        unsigned DAC1PSS0               :1;
        unsigned DAC1PSS1               :1;
    };
} DAC1CON0bits_t;
