MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1768/mcu.h
extern volatile DAC3CON1bits_t DAC3CON1bits __at(0x598);
// bitfield macros
#define _DAC3CON1_DACR_POSN                                 0x0
#define _DAC3CON1_DACR_POSITION                             0x0
#define _DAC3CON1_DACR_SIZE                                 0x5
#define _DAC3CON1_DACR_LENGTH                               0x5
#define _DAC3CON1_DACR_MASK                                 0x1F
#define _DAC3CON1_DACR0_POSN                                0x0
#define _DAC3CON1_DACR0_POSITION                            0x0
#define _DAC3CON1_DACR0_SIZE                                0x1
#define _DAC3CON1_DACR0_LENGTH                              0x1
#define _DAC3CON1_DACR0_MASK                                0x1
#define _DAC3CON1_DACR1_POSN                                0x1
#define _DAC3CON1_DACR1_POSITION                            0x1
#define _DAC3CON1_DACR1_SIZE                                0x1
#define _DAC3CON1_DACR1_LENGTH                              0x1
#define _DAC3CON1_DACR1_MASK                                0x2
#define _DAC3CON1_DACR2_POSN                                0x2
#define _DAC3CON1_DACR2_POSITION                            0x2
#define _DAC3CON1_DACR2_SIZE                                0x1
#define _DAC3CON1_DACR2_LENGTH                              0x1
#define _DAC3CON1_DACR2_MASK                                0x4
#define _DAC3CON1_DACR3_POSN                                0x3
#define _DAC3CON1_DACR3_POSITION                            0x3
#define _DAC3CON1_DACR3_SIZE                                0x1
#define _DAC3CON1_DACR3_LENGTH                              0x1
#define _DAC3CON1_DACR3_MASK                                0x8
#define _DAC3CON1_DACR4_POSN                                0x4
#define _DAC3CON1_DACR4_POSITION                            0x4
#define _DAC3CON1_DACR4_SIZE                                0x1
#define _DAC3CON1_DACR4_LENGTH                              0x1
#define _DAC3CON1_DACR4_MASK                                0x10
#define _DAC3CON1_R0_POSN                                   0x0
#define _DAC3CON1_R0_POSITION                               0x0
#define _DAC3CON1_R0_SIZE                                   0x1
#define _DAC3CON1_R0_LENGTH                                 0x1
#define _DAC3CON1_R0_MASK                                   0x1
#define _DAC3CON1_R1_POSN                                   0x1
#define _DAC3CON1_R1_POSITION                               0x1
#define _DAC3CON1_R1_SIZE                                   0x1
#define _DAC3CON1_R1_LENGTH                                 0x1
#define _DAC3CON1_R1_MASK                                   0x2
#define _DAC3CON1_R2_POSN                                   0x2
#define _DAC3CON1_R2_POSITION                               0x2
#define _DAC3CON1_R2_SIZE                                   0x1
#define _DAC3CON1_R2_LENGTH                                 0x1
#define _DAC3CON1_R2_MASK                                   0x4
#define _DAC3CON1_R3_POSN                                   0x3
#define _DAC3CON1_R3_POSITION                               0x3
#define _DAC3CON1_R3_SIZE                                   0x1
#define _DAC3CON1_R3_LENGTH                                 0x1
#define _DAC3CON1_R3_MASK                                   0x8
#define _DAC3CON1_R4_POSN                                   0x4
#define _DAC3CON1_R4_POSITION                               0x4
#define _DAC3CON1_R4_SIZE                                   0x1
#define _DAC3CON1_R4_LENGTH                                 0x1
#define _DAC3CON1_R4_MASK                                   0x10
#define _DAC3CON1_DAC3R_POSN                                0x0
#define _DAC3CON1_DAC3R_POSITION                            0x0
#define _DAC3CON1_DAC3R_SIZE                                0x5
#define _DAC3CON1_DAC3R_LENGTH                              0x5
#define _DAC3CON1_DAC3R_MASK                                0x1F
#define _DAC3CON1_DAC3R0_POSN                               0x0
#define _DAC3CON1_DAC3R0_POSITION                           0x0
#define _DAC3CON1_DAC3R0_SIZE                               0x1
#define _DAC3CON1_DAC3R0_LENGTH                             0x1
#define _DAC3CON1_DAC3R0_MASK                               0x1
#define _DAC3CON1_DAC3R1_POSN                               0x1
#define _DAC3CON1_DAC3R1_POSITION                           0x1
#define _DAC3CON1_DAC3R1_SIZE                               0x1
#define _DAC3CON1_DAC3R1_LENGTH                             0x1
#define _DAC3CON1_DAC3R1_MASK                               0x2
#define _DAC3CON1_DAC3R2_POSN                               0x2
#define _DAC3CON1_DAC3R2_POSITION                           0x2
#define _DAC3CON1_DAC3R2_SIZE                               0x1
#define _DAC3CON1_DAC3R2_LENGTH                             0x1
#define _DAC3CON1_DAC3R2_MASK                               0x4
#define _DAC3CON1_DAC3R3_POSN                               0x3
#define _DAC3CON1_DAC3R3_POSITION                           0x3
#define _DAC3CON1_DAC3R3_SIZE                               0x1
#define _DAC3CON1_DAC3R3_LENGTH                             0x1
#define _DAC3CON1_DAC3R3_MASK                               0x8
#define _DAC3CON1_DAC3R4_POSN                               0x4
#define _DAC3CON1_DAC3R4_POSITION                           0x4
#define _DAC3CON1_DAC3R4_SIZE                               0x1
#define _DAC3CON1_DAC3R4_LENGTH                             0x1
#define _DAC3CON1_DAC3R4_MASK                               0x10
#define _DAC3CON1_REF0_POSN                                 0x0
#define _DAC3CON1_REF0_POSITION                             0x0
#define _DAC3CON1_REF0_SIZE                                 0x1
#define _DAC3CON1_REF0_LENGTH                               0x1
#define _DAC3CON1_REF0_MASK                                 0x1
#define _DAC3CON1_REF1_POSN                                 0x1
#define _DAC3CON1_REF1_POSITION                             0x1
#define _DAC3CON1_REF1_SIZE                                 0x1
#define _DAC3CON1_REF1_LENGTH                               0x1
#define _DAC3CON1_REF1_MASK                                 0x2
#define _DAC3CON1_REF2_POSN                                 0x2
#define _DAC3CON1_REF2_POSITION                             0x2
#define _DAC3CON1_REF2_SIZE                                 0x1
#define _DAC3CON1_REF2_LENGTH                               0x1
#define _DAC3CON1_REF2_MASK                                 0x4
#define _DAC3CON1_REF3_POSN                                 0x3
#define _DAC3CON1_REF3_POSITION                             0x3
#define _DAC3CON1_REF3_SIZE                                 0x1
#define _DAC3CON1_REF3_LENGTH                               0x1
#define _DAC3CON1_REF3_MASK                                 0x8
#define _DAC3CON1_REF4_POSN                                 0x4
#define _DAC3CON1_REF4_POSITION                             0x4
#define _DAC3CON1_REF4_SIZE                                 0x1
#define _DAC3CON1_REF4_LENGTH                               0x1
#define _DAC3CON1_REF4_MASK                                 0x10
#define _DAC3CON1_REF5_POSN                                 0x5
#define _DAC3CON1_REF5_POSITION                             0x5
#define _DAC3CON1_REF5_SIZE                                 0x1
#define _DAC3CON1_REF5_LENGTH                               0x1
#define _DAC3CON1_REF5_MASK                                 0x20
#define _DAC3CON1_DAC3REF0_POSN                             0x0
#define _DAC3CON1_DAC3REF0_POSITION                         0x0
#define _DAC3CON1_DAC3REF0_SIZE                             0x1
#define _DAC3CON1_DAC3REF0_LENGTH                           0x1
#define _DAC3CON1_DAC3REF0_MASK                             0x1
#define _DAC3CON1_DAC3REF1_POSN                             0x1
#define _DAC3CON1_DAC3REF1_POSITION                         0x1
#define _DAC3CON1_DAC3REF1_SIZE                             0x1
#define _DAC3CON1_DAC3REF1_LENGTH                           0x1
#define _DAC3CON1_DAC3REF1_MASK                             0x2
#define _DAC3CON1_DAC3REF2_POSN                             0x2
#define _DAC3CON1_DAC3REF2_POSITION                         0x2
#define _DAC3CON1_DAC3REF2_SIZE                             0x1
#define _DAC3CON1_DAC3REF2_LENGTH                           0x1
#define _DAC3CON1_DAC3REF2_MASK                             0x4
#define _DAC3CON1_DAC3REF3_POSN                             0x3
#define _DAC3CON1_DAC3REF3_POSITION                         0x3
#define _DAC3CON1_DAC3REF3_SIZE                             0x1
#define _DAC3CON1_DAC3REF3_LENGTH                           0x1
#define _DAC3CON1_DAC3REF3_MASK                             0x8
#define _DAC3CON1_DAC3REF4_POSN                             0x4
#define _DAC3CON1_DAC3REF4_POSITION                         0x4
#define _DAC3CON1_DAC3REF4_SIZE                             0x1
#define _DAC3CON1_DAC3REF4_LENGTH                           0x1
#define _DAC3CON1_DAC3REF4_MASK                             0x10
#define _DAC3CON1_DAC3REF5_POSN                             0x5
#define _DAC3CON1_DAC3REF5_POSITION                         0x5
#define _DAC3CON1_DAC3REF5_SIZE                             0x1
#define _DAC3CON1_DAC3REF5_LENGTH                           0x1
#define _DAC3CON1_DAC3REF5_MASK                             0x20

// Register: DAC4CON0
#define DAC4CON0 DAC4CON0
extern volatile unsigned char           DAC4CON0            __at(0x599);
#ifndef _LIB_BUILD
asm("DAC4CON0 equ 0599h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NSS                    :1;
        unsigned                        :1;
        unsigned PSS                    :2;
        unsigned                        :1;
        unsigned OE1                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :2;
        unsigned PSS0                   :1;
        unsigned PSS1                   :1;
    };
    struct {
        unsigned DACNSS                 :1;
        unsigned                        :1;
        unsigned DACPSS                 :2;
        unsigned                        :1;
        unsigned DACOE1                 :1;
        unsigned                        :1;
        unsigned DACEN                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned DACPSS0                :1;
        unsigned DACPSS1                :1;
    };
    struct {
        unsigned DAC4NSS                :1;
        unsigned                        :1;
        unsigned DAC4PSS                :2;
        unsigned                        :1;
        unsigned DAC4OE1                :1;
        unsigned                        :1;
        unsigned DAC4EN                 :1;
    };
    struct {
        unsigned                        :2;
        unsigned DAC4PSS0               :1;
        unsigned DAC4PSS1               :1;
    };
} DAC4CON0bits_t;
extern volatile DAC4CON0bits_t DAC4CON0bits __at(0x599);
// bitfield macros
#define _DAC4CON0_NSS_POSN                                  0x0
#define _DAC4CON0_NSS_POSITION                              0x0
#define _DAC4CON0_NSS_SIZE                                  0x1
#define _DAC4CON0_NSS_LENGTH                                0x1
#define _DAC4CON0_NSS_MASK                                  0x1
#define _DAC4CON0_PSS_POSN                                  0x2
#define _DAC4CON0_PSS_POSITION                              0x2
#define _DAC4CON0_PSS_SIZE                                  0x2
#define _DAC4CON0_PSS_LENGTH                                0x2
#define _DAC4CON0_PSS_MASK                                  0xC
#define _DAC4CON0_OE1_POSN                                  0x5
#define _DAC4CON0_OE1_POSITION                              0x5
#define _DAC4CON0_OE1_SIZE                                  0x1
#define _DAC4CON0_OE1_LENGTH                                0x1
#define _DAC4CON0_OE1_MASK                                  0x20
#define _DAC4CON0_EN_POSN                                   0x7
#define _DAC4CON0_EN_POSITION                               0x7
#define _DAC4CON0_EN_SIZE                                   0x1
#define _DAC4CON0_EN_LENGTH                                 0x1
#define _DAC4CON0_EN_MASK                                   0x80
#define _DAC4CON0_PSS0_POSN                                 0x2
#define _DAC4CON0_PSS0_POSITION                             0x2
#define _DAC4CON0_PSS0_SIZE                                 0x1
#define _DAC4CON0_PSS0_LENGTH                               0x1
#define _DAC4CON0_PSS0_MASK                                 0x4
#define _DAC4CON0_PSS1_POSN                                 0x3
#define _DAC4CON0_PSS1_POSITION                             0x3
#define _DAC4CON0_PSS1_SIZE                                 0x1
#define _DAC4CON0_PSS1_LENGTH                               0x1
#define _DAC4CON0_PSS1_MASK                                 0x8
#define _DAC4CON0_DACNSS_POSN                               0x0
#define _DAC4CON0_DACNSS_POSITION                           0x0
#define _DAC4CON0_DACNSS_SIZE                               0x1
#define _DAC4CON0_DACNSS_LENGTH                             0x1
#define _DAC4CON0_DACNSS_MASK                               0x1
#define _DAC4CON0_DACPSS_POSN                               0x2
#define _DAC4CON0_DACPSS_POSITION                           0x2
#define _DAC4CON0_DACPSS_SIZE                               0x2
#define _DAC4CON0_DACPSS_LENGTH                             0x2
#define _DAC4CON0_DACPSS_MASK                               0xC
#define _DAC4CON0_DACOE1_POSN                               0x5
#define _DAC4CON0_DACOE1_POSITION                           0x5
#define _DAC4CON0_DACOE1_SIZE                               0x1
#define _DAC4CON0_DACOE1_LENGTH                             0x1
#define _DAC4CON0_DACOE1_MASK                               0x20
#define _DAC4CON0_DACEN_POSN                                0x7
#define _DAC4CON0_DACEN_POSITION                            0x7
#define _DAC4CON0_DACEN_SIZE                                0x1
#define _DAC4CON0_DACEN_LENGTH                              0x1
#define _DAC4CON0_DACEN_MASK                                0x80
#define _DAC4CON0_DACPSS0_POSN                              0x2
#define _DAC4CON0_DACPSS0_POSITION                          0x2
#define _DAC4CON0_DACPSS0_SIZE                              0x1
#define _DAC4CON0_DACPSS0_LENGTH                            0x1
#define _DAC4CON0_DACPSS0_MASK                              0x4
#define _DAC4CON0_DACPSS1_POSN                              0x3
#define _DAC4CON0_DACPSS1_POSITION                          0x3
#define _DAC4CON0_DACPSS1_SIZE                              0x1
#define _DAC4CON0_DACPSS1_LENGTH                            0x1
#define _DAC4CON0_DACPSS1_MASK                              0x8
#define _DAC4CON0_DAC4NSS_POSN                              0x0
#define _DAC4CON0_DAC4NSS_POSITION                          0x0
#define _DAC4CON0_DAC4NSS_SIZE                              0x1
#define _DAC4CON0_DAC4NSS_LENGTH                            0x1
#define _DAC4CON0_DAC4NSS_MASK                              0x1
#define _DAC4CON0_DAC4PSS_POSN                              0x2
#define _DAC4CON0_DAC4PSS_POSITION                          0x2
#define _DAC4CON0_DAC4PSS_SIZE                              0x2
#define _DAC4CON0_DAC4PSS_LENGTH                            0x2
#define _DAC4CON0_DAC4PSS_MASK                              0xC
#define _DAC4CON0_DAC4OE1_POSN                              0x5
#define _DAC4CON0_DAC4OE1_POSITION                          0x5
#define _DAC4CON0_DAC4OE1_SIZE                              0x1
#define _DAC4CON0_DAC4OE1_LENGTH                            0x1
#define _DAC4CON0_DAC4OE1_MASK                              0x20
#define _DAC4CON0_DAC4EN_POSN                               0x7
#define _DAC4CON0_DAC4EN_POSITION                           0x7
#define _DAC4CON0_DAC4EN_SIZE                               0x1
#define _DAC4CON0_DAC4EN_LENGTH                             0x1
#define _DAC4CON0_DAC4EN_MASK                               0x80
#define _DAC4CON0_DAC4PSS0_POSN                             0x2
#define _DAC4CON0_DAC4PSS0_POSITION                         0x2
#define _DAC4CON0_DAC4PSS0_SIZE                             0x1
#define _DAC4CON0_DAC4PSS0_LENGTH                           0x1
#define _DAC4CON0_DAC4PSS0_MASK                             0x4
#define _DAC4CON0_DAC4PSS1_POSN                             0x3
#define _DAC4CON0_DAC4PSS1_POSITION                         0x3
#define _DAC4CON0_DAC4PSS1_SIZE                             0x1
#define _DAC4CON0_DAC4PSS1_LENGTH                           0x1
#define _DAC4CON0_DAC4PSS1_MASK                             0x8

// Register: DAC4REF
#define DAC4REF DAC4REF
extern volatile unsigned char           DAC4REF             __at(0x59A);
#ifndef _LIB_BUILD
asm("DAC4REF equ 059Ah");
#endif
// aliases
extern volatile unsigned char           DAC4CON1            __at(0x59A);
#ifndef _LIB_BUILD
asm("DAC4CON1 equ 059Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DACR                   :5;
    };
    struct {
        unsigned DACR0                  :1;
        unsigned DACR1                  :1;
        unsigned DACR2                  :1;
        unsigned DACR3                  :1;
        unsigned DACR4                  :1;
    };
    struct {
        unsigned R0                     :1;
        unsigned R1                     :1;
        unsigned R2                     :1;
        unsigned R3                     :1;
        unsigned R4                     :1;
    };
    struct {
        unsigned DAC4R                  :5;
    };
    struct {
        unsigned DAC4R0                 :1;
        unsigned DAC4R1                 :1;
        unsigned DAC4R2                 :1;
        unsigned DAC4R3                 :1;
        unsigned DAC4R4                 :1;
    };
    struct {
        unsigned REF0                   :1;
        unsigned REF1                   :1;
        unsigned REF2                   :1;
        unsigned REF3                   :1;
        unsigned REF4                   :1;
        unsigned REF5                   :1;
    };
    struct {
        unsigned DAC4REF0               :1;
        unsigned DAC4REF1               :1;
        unsigned DAC4REF2               :1;
        unsigned DAC4REF3               :1;
        unsigned DAC4REF4               :1;
        unsigned DAC4REF5               :1;
    };
} DAC4REFbits_t;
