MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1768/mcu.h
extern volatile DAC4REFbits_t DAC4REFbits __at(0x59A);
// bitfield macros
#define _DAC4REF_DACR_POSN                                  0x0
#define _DAC4REF_DACR_POSITION                              0x0
#define _DAC4REF_DACR_SIZE                                  0x5
#define _DAC4REF_DACR_LENGTH                                0x5
#define _DAC4REF_DACR_MASK                                  0x1F
#define _DAC4REF_DACR0_POSN                                 0x0
#define _DAC4REF_DACR0_POSITION                             0x0
#define _DAC4REF_DACR0_SIZE                                 0x1
#define _DAC4REF_DACR0_LENGTH                               0x1
#define _DAC4REF_DACR0_MASK                                 0x1
#define _DAC4REF_DACR1_POSN                                 0x1
#define _DAC4REF_DACR1_POSITION                             0x1
#define _DAC4REF_DACR1_SIZE                                 0x1
#define _DAC4REF_DACR1_LENGTH                               0x1
#define _DAC4REF_DACR1_MASK                                 0x2
#define _DAC4REF_DACR2_POSN                                 0x2
#define _DAC4REF_DACR2_POSITION                             0x2
#define _DAC4REF_DACR2_SIZE                                 0x1
#define _DAC4REF_DACR2_LENGTH                               0x1
#define _DAC4REF_DACR2_MASK                                 0x4
#define _DAC4REF_DACR3_POSN                                 0x3
#define _DAC4REF_DACR3_POSITION                             0x3
#define _DAC4REF_DACR3_SIZE                                 0x1
#define _DAC4REF_DACR3_LENGTH                               0x1
#define _DAC4REF_DACR3_MASK                                 0x8
#define _DAC4REF_DACR4_POSN                                 0x4
#define _DAC4REF_DACR4_POSITION                             0x4
#define _DAC4REF_DACR4_SIZE                                 0x1
#define _DAC4REF_DACR4_LENGTH                               0x1
#define _DAC4REF_DACR4_MASK                                 0x10
#define _DAC4REF_R0_POSN                                    0x0
#define _DAC4REF_R0_POSITION                                0x0
#define _DAC4REF_R0_SIZE                                    0x1
#define _DAC4REF_R0_LENGTH                                  0x1
#define _DAC4REF_R0_MASK                                    0x1
#define _DAC4REF_R1_POSN                                    0x1
#define _DAC4REF_R1_POSITION                                0x1
#define _DAC4REF_R1_SIZE                                    0x1
#define _DAC4REF_R1_LENGTH                                  0x1
#define _DAC4REF_R1_MASK                                    0x2
#define _DAC4REF_R2_POSN                                    0x2
#define _DAC4REF_R2_POSITION                                0x2
#define _DAC4REF_R2_SIZE                                    0x1
#define _DAC4REF_R2_LENGTH                                  0x1
#define _DAC4REF_R2_MASK                                    0x4
#define _DAC4REF_R3_POSN                                    0x3
#define _DAC4REF_R3_POSITION                                0x3
#define _DAC4REF_R3_SIZE                                    0x1
#define _DAC4REF_R3_LENGTH                                  0x1
#define _DAC4REF_R3_MASK                                    0x8
#define _DAC4REF_R4_POSN                                    0x4
#define _DAC4REF_R4_POSITION                                0x4
#define _DAC4REF_R4_SIZE                                    0x1
#define _DAC4REF_R4_LENGTH                                  0x1
#define _DAC4REF_R4_MASK                                    0x10
#define _DAC4REF_DAC4R_POSN                                 0x0
#define _DAC4REF_DAC4R_POSITION                             0x0
#define _DAC4REF_DAC4R_SIZE                                 0x5
#define _DAC4REF_DAC4R_LENGTH                               0x5
#define _DAC4REF_DAC4R_MASK                                 0x1F
#define _DAC4REF_DAC4R0_POSN                                0x0
#define _DAC4REF_DAC4R0_POSITION                            0x0
#define _DAC4REF_DAC4R0_SIZE                                0x1
#define _DAC4REF_DAC4R0_LENGTH                              0x1
#define _DAC4REF_DAC4R0_MASK                                0x1
#define _DAC4REF_DAC4R1_POSN                                0x1
#define _DAC4REF_DAC4R1_POSITION                            0x1
#define _DAC4REF_DAC4R1_SIZE                                0x1
#define _DAC4REF_DAC4R1_LENGTH                              0x1
#define _DAC4REF_DAC4R1_MASK                                0x2
#define _DAC4REF_DAC4R2_POSN                                0x2
#define _DAC4REF_DAC4R2_POSITION                            0x2
#define _DAC4REF_DAC4R2_SIZE                                0x1
#define _DAC4REF_DAC4R2_LENGTH                              0x1
#define _DAC4REF_DAC4R2_MASK                                0x4
#define _DAC4REF_DAC4R3_POSN                                0x3
#define _DAC4REF_DAC4R3_POSITION                            0x3
#define _DAC4REF_DAC4R3_SIZE                                0x1
#define _DAC4REF_DAC4R3_LENGTH                              0x1
#define _DAC4REF_DAC4R3_MASK                                0x8
#define _DAC4REF_DAC4R4_POSN                                0x4
#define _DAC4REF_DAC4R4_POSITION                            0x4
#define _DAC4REF_DAC4R4_SIZE                                0x1
#define _DAC4REF_DAC4R4_LENGTH                              0x1
#define _DAC4REF_DAC4R4_MASK                                0x10
#define _DAC4REF_REF0_POSN                                  0x0
#define _DAC4REF_REF0_POSITION                              0x0
#define _DAC4REF_REF0_SIZE                                  0x1
#define _DAC4REF_REF0_LENGTH                                0x1
#define _DAC4REF_REF0_MASK                                  0x1
#define _DAC4REF_REF1_POSN                                  0x1
#define _DAC4REF_REF1_POSITION                              0x1
#define _DAC4REF_REF1_SIZE                                  0x1
#define _DAC4REF_REF1_LENGTH                                0x1
#define _DAC4REF_REF1_MASK                                  0x2
#define _DAC4REF_REF2_POSN                                  0x2
#define _DAC4REF_REF2_POSITION                              0x2
#define _DAC4REF_REF2_SIZE                                  0x1
#define _DAC4REF_REF2_LENGTH                                0x1
#define _DAC4REF_REF2_MASK                                  0x4
#define _DAC4REF_REF3_POSN                                  0x3
#define _DAC4REF_REF3_POSITION                              0x3
#define _DAC4REF_REF3_SIZE                                  0x1
#define _DAC4REF_REF3_LENGTH                                0x1
#define _DAC4REF_REF3_MASK                                  0x8
#define _DAC4REF_REF4_POSN                                  0x4
#define _DAC4REF_REF4_POSITION                              0x4
#define _DAC4REF_REF4_SIZE                                  0x1
#define _DAC4REF_REF4_LENGTH                                0x1
#define _DAC4REF_REF4_MASK                                  0x10
#define _DAC4REF_REF5_POSN                                  0x5
#define _DAC4REF_REF5_POSITION                              0x5
#define _DAC4REF_REF5_SIZE                                  0x1
#define _DAC4REF_REF5_LENGTH                                0x1
#define _DAC4REF_REF5_MASK                                  0x20
#define _DAC4REF_DAC4REF0_POSN                              0x0
#define _DAC4REF_DAC4REF0_POSITION                          0x0
#define _DAC4REF_DAC4REF0_SIZE                              0x1
#define _DAC4REF_DAC4REF0_LENGTH                            0x1
#define _DAC4REF_DAC4REF0_MASK                              0x1
#define _DAC4REF_DAC4REF1_POSN                              0x1
#define _DAC4REF_DAC4REF1_POSITION                          0x1
#define _DAC4REF_DAC4REF1_SIZE                              0x1
#define _DAC4REF_DAC4REF1_LENGTH                            0x1
#define _DAC4REF_DAC4REF1_MASK                              0x2
#define _DAC4REF_DAC4REF2_POSN                              0x2
#define _DAC4REF_DAC4REF2_POSITION                          0x2
#define _DAC4REF_DAC4REF2_SIZE                              0x1
#define _DAC4REF_DAC4REF2_LENGTH                            0x1
#define _DAC4REF_DAC4REF2_MASK                              0x4
#define _DAC4REF_DAC4REF3_POSN                              0x3
#define _DAC4REF_DAC4REF3_POSITION                          0x3
#define _DAC4REF_DAC4REF3_SIZE                              0x1
#define _DAC4REF_DAC4REF3_LENGTH                            0x1
#define _DAC4REF_DAC4REF3_MASK                              0x8
#define _DAC4REF_DAC4REF4_POSN                              0x4
#define _DAC4REF_DAC4REF4_POSITION                          0x4
#define _DAC4REF_DAC4REF4_SIZE                              0x1
#define _DAC4REF_DAC4REF4_LENGTH                            0x1
#define _DAC4REF_DAC4REF4_MASK                              0x10
#define _DAC4REF_DAC4REF5_POSN                              0x5
#define _DAC4REF_DAC4REF5_POSITION                          0x5
#define _DAC4REF_DAC4REF5_SIZE                              0x1
#define _DAC4REF_DAC4REF5_LENGTH                            0x1
#define _DAC4REF_DAC4REF5_MASK                              0x20
// alias bitfield definitions
typedef union {
    struct {
        unsigned DACR                   :5;
    };
    struct {
        unsigned DACR0                  :1;
        unsigned DACR1                  :1;
        unsigned DACR2                  :1;
        unsigned DACR3                  :1;
        unsigned DACR4                  :1;
    };
    struct {
        unsigned R0                     :1;
        unsigned R1                     :1;
        unsigned R2                     :1;
        unsigned R3                     :1;
        unsigned R4                     :1;
    };
    struct {
        unsigned DAC4R                  :5;
    };
    struct {
        unsigned DAC4R0                 :1;
        unsigned DAC4R1                 :1;
        unsigned DAC4R2                 :1;
        unsigned DAC4R3                 :1;
        unsigned DAC4R4                 :1;
    };
    struct {
        unsigned REF0                   :1;
        unsigned REF1                   :1;
        unsigned REF2                   :1;
        unsigned REF3                   :1;
        unsigned REF4                   :1;
        unsigned REF5                   :1;
    };
    struct {
        unsigned DAC4REF0               :1;
        unsigned DAC4REF1               :1;
        unsigned DAC4REF2               :1;
        unsigned DAC4REF3               :1;
        unsigned DAC4REF4               :1;
        unsigned DAC4REF5               :1;
    };
} DAC4CON1bits_t;
