MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1768/mcu.h
// Register: PRG2INS
#define PRG2INS PRG2INS
extern volatile unsigned char           PRG2INS             __at(0x79C);
#ifndef _LIB_BUILD
asm("PRG2INS equ 079Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INS                    :8;
    };
    struct {
        unsigned INS0                   :1;
        unsigned INS1                   :1;
        unsigned INS2                   :1;
        unsigned INS3                   :1;
    };
    struct {
        unsigned RG2INS0                :1;
        unsigned RG2INS1                :1;
        unsigned RG2INS2                :1;
        unsigned RG2INS3                :1;
    };
} PRG2INSbits_t;
extern volatile PRG2INSbits_t PRG2INSbits __at(0x79C);
// bitfield macros
#define _PRG2INS_INS_POSN                                   0x0
#define _PRG2INS_INS_POSITION                               0x0
#define _PRG2INS_INS_SIZE                                   0x8
#define _PRG2INS_INS_LENGTH                                 0x8
#define _PRG2INS_INS_MASK                                   0xFF
#define _PRG2INS_INS0_POSN                                  0x0
#define _PRG2INS_INS0_POSITION                              0x0
#define _PRG2INS_INS0_SIZE                                  0x1
#define _PRG2INS_INS0_LENGTH                                0x1
#define _PRG2INS_INS0_MASK                                  0x1
#define _PRG2INS_INS1_POSN                                  0x1
#define _PRG2INS_INS1_POSITION                              0x1
#define _PRG2INS_INS1_SIZE                                  0x1
#define _PRG2INS_INS1_LENGTH                                0x1
#define _PRG2INS_INS1_MASK                                  0x2
#define _PRG2INS_INS2_POSN                                  0x2
#define _PRG2INS_INS2_POSITION                              0x2
#define _PRG2INS_INS2_SIZE                                  0x1
#define _PRG2INS_INS2_LENGTH                                0x1
#define _PRG2INS_INS2_MASK                                  0x4
#define _PRG2INS_INS3_POSN                                  0x3
#define _PRG2INS_INS3_POSITION                              0x3
#define _PRG2INS_INS3_SIZE                                  0x1
#define _PRG2INS_INS3_LENGTH                                0x1
#define _PRG2INS_INS3_MASK                                  0x8
#define _PRG2INS_RG2INS0_POSN                               0x0
#define _PRG2INS_RG2INS0_POSITION                           0x0
#define _PRG2INS_RG2INS0_SIZE                               0x1
#define _PRG2INS_RG2INS0_LENGTH                             0x1
#define _PRG2INS_RG2INS0_MASK                               0x1
#define _PRG2INS_RG2INS1_POSN                               0x1
#define _PRG2INS_RG2INS1_POSITION                           0x1
#define _PRG2INS_RG2INS1_SIZE                               0x1
#define _PRG2INS_RG2INS1_LENGTH                             0x1
#define _PRG2INS_RG2INS1_MASK                               0x2
#define _PRG2INS_RG2INS2_POSN                               0x2
#define _PRG2INS_RG2INS2_POSITION                           0x2
#define _PRG2INS_RG2INS2_SIZE                               0x1
#define _PRG2INS_RG2INS2_LENGTH                             0x1
#define _PRG2INS_RG2INS2_MASK                               0x4
#define _PRG2INS_RG2INS3_POSN                               0x3
#define _PRG2INS_RG2INS3_POSITION                           0x3
#define _PRG2INS_RG2INS3_SIZE                               0x1
#define _PRG2INS_RG2INS3_LENGTH                             0x1
#define _PRG2INS_RG2INS3_MASK                               0x8

// Register: PRG2CON0
#define PRG2CON0 PRG2CON0
extern volatile unsigned char           PRG2CON0            __at(0x79D);
#ifndef _LIB_BUILD
asm("PRG2CON0 equ 079Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned GO                     :1;
        unsigned OS                     :1;
        unsigned MODE                   :2;
        unsigned REDG                   :1;
        unsigned FEDG                   :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :2;
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
    };
    struct {
        unsigned RG2GO                  :1;
        unsigned RG2OS                  :1;
        unsigned RG2MODE                :2;
        unsigned RG2REDG                :1;
        unsigned RG2FEDG                :1;
        unsigned                        :1;
        unsigned RG2EN                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned RG2MODE0               :1;
        unsigned RG2MODE1               :1;
    };
} PRG2CON0bits_t;
extern volatile PRG2CON0bits_t PRG2CON0bits __at(0x79D);
// bitfield macros
#define _PRG2CON0_GO_POSN                                   0x0
#define _PRG2CON0_GO_POSITION                               0x0
#define _PRG2CON0_GO_SIZE                                   0x1
#define _PRG2CON0_GO_LENGTH                                 0x1
#define _PRG2CON0_GO_MASK                                   0x1
#define _PRG2CON0_OS_POSN                                   0x1
#define _PRG2CON0_OS_POSITION                               0x1
#define _PRG2CON0_OS_SIZE                                   0x1
#define _PRG2CON0_OS_LENGTH                                 0x1
#define _PRG2CON0_OS_MASK                                   0x2
#define _PRG2CON0_MODE_POSN                                 0x2
#define _PRG2CON0_MODE_POSITION                             0x2
#define _PRG2CON0_MODE_SIZE                                 0x2
#define _PRG2CON0_MODE_LENGTH                               0x2
#define _PRG2CON0_MODE_MASK                                 0xC
#define _PRG2CON0_REDG_POSN                                 0x4
#define _PRG2CON0_REDG_POSITION                             0x4
#define _PRG2CON0_REDG_SIZE                                 0x1
#define _PRG2CON0_REDG_LENGTH                               0x1
#define _PRG2CON0_REDG_MASK                                 0x10
#define _PRG2CON0_FEDG_POSN                                 0x5
#define _PRG2CON0_FEDG_POSITION                             0x5
#define _PRG2CON0_FEDG_SIZE                                 0x1
#define _PRG2CON0_FEDG_LENGTH                               0x1
#define _PRG2CON0_FEDG_MASK                                 0x20
#define _PRG2CON0_EN_POSN                                   0x7
#define _PRG2CON0_EN_POSITION                               0x7
#define _PRG2CON0_EN_SIZE                                   0x1
#define _PRG2CON0_EN_LENGTH                                 0x1
#define _PRG2CON0_EN_MASK                                   0x80
#define _PRG2CON0_MODE0_POSN                                0x2
#define _PRG2CON0_MODE0_POSITION                            0x2
#define _PRG2CON0_MODE0_SIZE                                0x1
#define _PRG2CON0_MODE0_LENGTH                              0x1
#define _PRG2CON0_MODE0_MASK                                0x4
#define _PRG2CON0_MODE1_POSN                                0x3
#define _PRG2CON0_MODE1_POSITION                            0x3
#define _PRG2CON0_MODE1_SIZE                                0x1
#define _PRG2CON0_MODE1_LENGTH                              0x1
#define _PRG2CON0_MODE1_MASK                                0x8
#define _PRG2CON0_RG2GO_POSN                                0x0
#define _PRG2CON0_RG2GO_POSITION                            0x0
#define _PRG2CON0_RG2GO_SIZE                                0x1
#define _PRG2CON0_RG2GO_LENGTH                              0x1
#define _PRG2CON0_RG2GO_MASK                                0x1
#define _PRG2CON0_RG2OS_POSN                                0x1
#define _PRG2CON0_RG2OS_POSITION                            0x1
#define _PRG2CON0_RG2OS_SIZE                                0x1
#define _PRG2CON0_RG2OS_LENGTH                              0x1
#define _PRG2CON0_RG2OS_MASK                                0x2
#define _PRG2CON0_RG2MODE_POSN                              0x2
#define _PRG2CON0_RG2MODE_POSITION                          0x2
#define _PRG2CON0_RG2MODE_SIZE                              0x2
#define _PRG2CON0_RG2MODE_LENGTH                            0x2
#define _PRG2CON0_RG2MODE_MASK                              0xC
#define _PRG2CON0_RG2REDG_POSN                              0x4
#define _PRG2CON0_RG2REDG_POSITION                          0x4
#define _PRG2CON0_RG2REDG_SIZE                              0x1
#define _PRG2CON0_RG2REDG_LENGTH                            0x1
#define _PRG2CON0_RG2REDG_MASK                              0x10
#define _PRG2CON0_RG2FEDG_POSN                              0x5
#define _PRG2CON0_RG2FEDG_POSITION                          0x5
#define _PRG2CON0_RG2FEDG_SIZE                              0x1
#define _PRG2CON0_RG2FEDG_LENGTH                            0x1
#define _PRG2CON0_RG2FEDG_MASK                              0x20
#define _PRG2CON0_RG2EN_POSN                                0x7
#define _PRG2CON0_RG2EN_POSITION                            0x7
#define _PRG2CON0_RG2EN_SIZE                                0x1
#define _PRG2CON0_RG2EN_LENGTH                              0x1
#define _PRG2CON0_RG2EN_MASK                                0x80
#define _PRG2CON0_RG2MODE0_POSN                             0x2
#define _PRG2CON0_RG2MODE0_POSITION                         0x2
#define _PRG2CON0_RG2MODE0_SIZE                             0x1
#define _PRG2CON0_RG2MODE0_LENGTH                           0x1
#define _PRG2CON0_RG2MODE0_MASK                             0x4
#define _PRG2CON0_RG2MODE1_POSN                             0x3
#define _PRG2CON0_RG2MODE1_POSITION                         0x3
#define _PRG2CON0_RG2MODE1_SIZE                             0x1
#define _PRG2CON0_RG2MODE1_LENGTH                           0x1
#define _PRG2CON0_RG2MODE1_MASK                             0x8

// Register: PRG2CON1
#define PRG2CON1 PRG2CON1
extern volatile unsigned char           PRG2CON1            __at(0x79E);
#ifndef _LIB_BUILD
asm("PRG2CON1 equ 079Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPOL                   :1;
        unsigned FPOL                   :1;
        unsigned RDY                    :1;
    };
    struct {
        unsigned RG2RPOL                :1;
        unsigned RG2FPOL                :1;
        unsigned RG2RDY                 :1;
    };
} PRG2CON1bits_t;
