MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1768/mcu.h
// Register: PWM5TMRL
#define PWM5TMRL PWM5TMRL
extern volatile unsigned char           PWM5TMRL            __at(0xD99);
#ifndef _LIB_BUILD
asm("PWM5TMRL equ 0D99h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned PWM5TMRL0              :1;
        unsigned PWM5TMRL1              :1;
        unsigned PWM5TMRL2              :1;
        unsigned PWM5TMRL3              :1;
        unsigned PWM5TMRL4              :1;
        unsigned PWM5TMRL5              :1;
        unsigned PWM5TMRL6              :1;
        unsigned PWM5TMRL7              :1;
    };
    struct {
        unsigned PWM5TMRL               :8;
    };
} PWM5TMRLbits_t;
extern volatile PWM5TMRLbits_t PWM5TMRLbits __at(0xD99);
// bitfield macros
#define _PWM5TMRL_TMR_POSN                                  0x0
#define _PWM5TMRL_TMR_POSITION                              0x0
#define _PWM5TMRL_TMR_SIZE                                  0x8
#define _PWM5TMRL_TMR_LENGTH                                0x8
#define _PWM5TMRL_TMR_MASK                                  0xFF
#define _PWM5TMRL_PWM5TMRL0_POSN                            0x0
#define _PWM5TMRL_PWM5TMRL0_POSITION                        0x0
#define _PWM5TMRL_PWM5TMRL0_SIZE                            0x1
#define _PWM5TMRL_PWM5TMRL0_LENGTH                          0x1
#define _PWM5TMRL_PWM5TMRL0_MASK                            0x1
#define _PWM5TMRL_PWM5TMRL1_POSN                            0x1
#define _PWM5TMRL_PWM5TMRL1_POSITION                        0x1
#define _PWM5TMRL_PWM5TMRL1_SIZE                            0x1
#define _PWM5TMRL_PWM5TMRL1_LENGTH                          0x1
#define _PWM5TMRL_PWM5TMRL1_MASK                            0x2
#define _PWM5TMRL_PWM5TMRL2_POSN                            0x2
#define _PWM5TMRL_PWM5TMRL2_POSITION                        0x2
#define _PWM5TMRL_PWM5TMRL2_SIZE                            0x1
#define _PWM5TMRL_PWM5TMRL2_LENGTH                          0x1
#define _PWM5TMRL_PWM5TMRL2_MASK                            0x4
#define _PWM5TMRL_PWM5TMRL3_POSN                            0x3
#define _PWM5TMRL_PWM5TMRL3_POSITION                        0x3
#define _PWM5TMRL_PWM5TMRL3_SIZE                            0x1
#define _PWM5TMRL_PWM5TMRL3_LENGTH                          0x1
#define _PWM5TMRL_PWM5TMRL3_MASK                            0x8
#define _PWM5TMRL_PWM5TMRL4_POSN                            0x4
#define _PWM5TMRL_PWM5TMRL4_POSITION                        0x4
#define _PWM5TMRL_PWM5TMRL4_SIZE                            0x1
#define _PWM5TMRL_PWM5TMRL4_LENGTH                          0x1
#define _PWM5TMRL_PWM5TMRL4_MASK                            0x10
#define _PWM5TMRL_PWM5TMRL5_POSN                            0x5
#define _PWM5TMRL_PWM5TMRL5_POSITION                        0x5
#define _PWM5TMRL_PWM5TMRL5_SIZE                            0x1
#define _PWM5TMRL_PWM5TMRL5_LENGTH                          0x1
#define _PWM5TMRL_PWM5TMRL5_MASK                            0x20
#define _PWM5TMRL_PWM5TMRL6_POSN                            0x6
#define _PWM5TMRL_PWM5TMRL6_POSITION                        0x6
#define _PWM5TMRL_PWM5TMRL6_SIZE                            0x1
#define _PWM5TMRL_PWM5TMRL6_LENGTH                          0x1
#define _PWM5TMRL_PWM5TMRL6_MASK                            0x40
#define _PWM5TMRL_PWM5TMRL7_POSN                            0x7
#define _PWM5TMRL_PWM5TMRL7_POSITION                        0x7
#define _PWM5TMRL_PWM5TMRL7_SIZE                            0x1
#define _PWM5TMRL_PWM5TMRL7_LENGTH                          0x1
#define _PWM5TMRL_PWM5TMRL7_MASK                            0x80
#define _PWM5TMRL_PWM5TMRL_POSN                             0x0
#define _PWM5TMRL_PWM5TMRL_POSITION                         0x0
#define _PWM5TMRL_PWM5TMRL_SIZE                             0x8
#define _PWM5TMRL_PWM5TMRL_LENGTH                           0x8
#define _PWM5TMRL_PWM5TMRL_MASK                             0xFF

// Register: PWM5TMRH
#define PWM5TMRH PWM5TMRH
extern volatile unsigned char           PWM5TMRH            __at(0xD9A);
#ifndef _LIB_BUILD
asm("PWM5TMRH equ 0D9Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned PWM5TMRH0              :1;
        unsigned PWM5TMRH1              :1;
        unsigned PWM5TMRH2              :1;
        unsigned PWM5TMRH3              :1;
        unsigned PWM5TMRH4              :1;
        unsigned PWM5TMRH5              :1;
        unsigned PWM5TMRH6              :1;
        unsigned PWM5TMRH7              :1;
    };
    struct {
        unsigned PWM5TMRH               :8;
    };
} PWM5TMRHbits_t;
extern volatile PWM5TMRHbits_t PWM5TMRHbits __at(0xD9A);
// bitfield macros
#define _PWM5TMRH_TMR_POSN                                  0x0
#define _PWM5TMRH_TMR_POSITION                              0x0
#define _PWM5TMRH_TMR_SIZE                                  0x8
#define _PWM5TMRH_TMR_LENGTH                                0x8
#define _PWM5TMRH_TMR_MASK                                  0xFF
#define _PWM5TMRH_PWM5TMRH0_POSN                            0x0
#define _PWM5TMRH_PWM5TMRH0_POSITION                        0x0
#define _PWM5TMRH_PWM5TMRH0_SIZE                            0x1
#define _PWM5TMRH_PWM5TMRH0_LENGTH                          0x1
#define _PWM5TMRH_PWM5TMRH0_MASK                            0x1
#define _PWM5TMRH_PWM5TMRH1_POSN                            0x1
#define _PWM5TMRH_PWM5TMRH1_POSITION                        0x1
#define _PWM5TMRH_PWM5TMRH1_SIZE                            0x1
#define _PWM5TMRH_PWM5TMRH1_LENGTH                          0x1
#define _PWM5TMRH_PWM5TMRH1_MASK                            0x2
#define _PWM5TMRH_PWM5TMRH2_POSN                            0x2
#define _PWM5TMRH_PWM5TMRH2_POSITION                        0x2
#define _PWM5TMRH_PWM5TMRH2_SIZE                            0x1
#define _PWM5TMRH_PWM5TMRH2_LENGTH                          0x1
#define _PWM5TMRH_PWM5TMRH2_MASK                            0x4
#define _PWM5TMRH_PWM5TMRH3_POSN                            0x3
#define _PWM5TMRH_PWM5TMRH3_POSITION                        0x3
#define _PWM5TMRH_PWM5TMRH3_SIZE                            0x1
#define _PWM5TMRH_PWM5TMRH3_LENGTH                          0x1
#define _PWM5TMRH_PWM5TMRH3_MASK                            0x8
#define _PWM5TMRH_PWM5TMRH4_POSN                            0x4
#define _PWM5TMRH_PWM5TMRH4_POSITION                        0x4
#define _PWM5TMRH_PWM5TMRH4_SIZE                            0x1
#define _PWM5TMRH_PWM5TMRH4_LENGTH                          0x1
#define _PWM5TMRH_PWM5TMRH4_MASK                            0x10
#define _PWM5TMRH_PWM5TMRH5_POSN                            0x5
#define _PWM5TMRH_PWM5TMRH5_POSITION                        0x5
#define _PWM5TMRH_PWM5TMRH5_SIZE                            0x1
#define _PWM5TMRH_PWM5TMRH5_LENGTH                          0x1
#define _PWM5TMRH_PWM5TMRH5_MASK                            0x20
#define _PWM5TMRH_PWM5TMRH6_POSN                            0x6
#define _PWM5TMRH_PWM5TMRH6_POSITION                        0x6
#define _PWM5TMRH_PWM5TMRH6_SIZE                            0x1
#define _PWM5TMRH_PWM5TMRH6_LENGTH                          0x1
#define _PWM5TMRH_PWM5TMRH6_MASK                            0x40
#define _PWM5TMRH_PWM5TMRH7_POSN                            0x7
#define _PWM5TMRH_PWM5TMRH7_POSITION                        0x7
#define _PWM5TMRH_PWM5TMRH7_SIZE                            0x1
#define _PWM5TMRH_PWM5TMRH7_LENGTH                          0x1
#define _PWM5TMRH_PWM5TMRH7_MASK                            0x80
#define _PWM5TMRH_PWM5TMRH_POSN                             0x0
#define _PWM5TMRH_PWM5TMRH_POSITION                         0x0
#define _PWM5TMRH_PWM5TMRH_SIZE                             0x8
#define _PWM5TMRH_PWM5TMRH_LENGTH                           0x8
#define _PWM5TMRH_PWM5TMRH_MASK                             0xFF

// Register: PWM5CON
#define PWM5CON PWM5CON
extern volatile unsigned char           PWM5CON             __at(0xD9B);
#ifndef _LIB_BUILD
asm("PWM5CON equ 0D9Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned MODE                   :2;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :2;
        unsigned PWM5MODE0              :1;
        unsigned PWM5MODE1              :1;
    };
    struct {
        unsigned                        :2;
        unsigned PWM5MODE               :2;
        unsigned PWM5POL                :1;
        unsigned PWM5OUT                :1;
        unsigned                        :1;
        unsigned PWM5EN                 :1;
    };
    struct {
        unsigned                        :2;
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
    };
} PWM5CONbits_t;
extern volatile PWM5CONbits_t PWM5CONbits __at(0xD9B);
// bitfield macros
#define _PWM5CON_MODE_POSN                                  0x2
#define _PWM5CON_MODE_POSITION                              0x2
#define _PWM5CON_MODE_SIZE                                  0x2
#define _PWM5CON_MODE_LENGTH                                0x2
#define _PWM5CON_MODE_MASK                                  0xC
#define _PWM5CON_POL_POSN                                   0x4
#define _PWM5CON_POL_POSITION                               0x4
#define _PWM5CON_POL_SIZE                                   0x1
#define _PWM5CON_POL_LENGTH                                 0x1
#define _PWM5CON_POL_MASK                                   0x10
#define _PWM5CON_OUT_POSN                                   0x5
#define _PWM5CON_OUT_POSITION                               0x5
#define _PWM5CON_OUT_SIZE                                   0x1
#define _PWM5CON_OUT_LENGTH                                 0x1
#define _PWM5CON_OUT_MASK                                   0x20
#define _PWM5CON_EN_POSN                                    0x7
#define _PWM5CON_EN_POSITION                                0x7
#define _PWM5CON_EN_SIZE                                    0x1
#define _PWM5CON_EN_LENGTH                                  0x1
#define _PWM5CON_EN_MASK                                    0x80
#define _PWM5CON_PWM5MODE0_POSN                             0x2
#define _PWM5CON_PWM5MODE0_POSITION                         0x2
#define _PWM5CON_PWM5MODE0_SIZE                             0x1
#define _PWM5CON_PWM5MODE0_LENGTH                           0x1
#define _PWM5CON_PWM5MODE0_MASK                             0x4
#define _PWM5CON_PWM5MODE1_POSN                             0x3
#define _PWM5CON_PWM5MODE1_POSITION                         0x3
#define _PWM5CON_PWM5MODE1_SIZE                             0x1
#define _PWM5CON_PWM5MODE1_LENGTH                           0x1
#define _PWM5CON_PWM5MODE1_MASK                             0x8
#define _PWM5CON_PWM5MODE_POSN                              0x2
#define _PWM5CON_PWM5MODE_POSITION                          0x2
#define _PWM5CON_PWM5MODE_SIZE                              0x2
#define _PWM5CON_PWM5MODE_LENGTH                            0x2
#define _PWM5CON_PWM5MODE_MASK                              0xC
#define _PWM5CON_PWM5POL_POSN                               0x4
#define _PWM5CON_PWM5POL_POSITION                           0x4
#define _PWM5CON_PWM5POL_SIZE                               0x1
#define _PWM5CON_PWM5POL_LENGTH                             0x1
#define _PWM5CON_PWM5POL_MASK                               0x10
#define _PWM5CON_PWM5OUT_POSN                               0x5
#define _PWM5CON_PWM5OUT_POSITION                           0x5
#define _PWM5CON_PWM5OUT_SIZE                               0x1
#define _PWM5CON_PWM5OUT_LENGTH                             0x1
#define _PWM5CON_PWM5OUT_MASK                               0x20
#define _PWM5CON_PWM5EN_POSN                                0x7
#define _PWM5CON_PWM5EN_POSITION                            0x7
#define _PWM5CON_PWM5EN_SIZE                                0x1
#define _PWM5CON_PWM5EN_LENGTH                              0x1
#define _PWM5CON_PWM5EN_MASK                                0x80
#define _PWM5CON_MODE0_POSN                                 0x2
#define _PWM5CON_MODE0_POSITION                             0x2
#define _PWM5CON_MODE0_SIZE                                 0x1
#define _PWM5CON_MODE0_LENGTH                               0x1
#define _PWM5CON_MODE0_MASK                                 0x4
#define _PWM5CON_MODE1_POSN                                 0x3
#define _PWM5CON_MODE1_POSITION                             0x3
#define _PWM5CON_MODE1_SIZE                                 0x1
#define _PWM5CON_MODE1_LENGTH                               0x1
#define _PWM5CON_MODE1_MASK                                 0x8

// Register: PWM5INTE
#define PWM5INTE PWM5INTE
extern volatile unsigned char           PWM5INTE            __at(0xD9C);
#ifndef _LIB_BUILD
asm("PWM5INTE equ 0D9Ch");
#endif
// aliases
extern volatile unsigned char           PWM5INTCON          __at(0xD9C);
#ifndef _LIB_BUILD
asm("PWM5INTCON equ 0D9Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRIE                   :1;
        unsigned DCIE                   :1;
        unsigned PHIE                   :1;
        unsigned OFIE                   :1;
    };
    struct {
        unsigned PWM5PRIE               :1;
        unsigned PWM5DCIE               :1;
        unsigned PWM5PHIE               :1;
        unsigned PWM5OFIE               :1;
    };
} PWM5INTEbits_t;
extern volatile PWM5INTEbits_t PWM5INTEbits __at(0xD9C);
// bitfield macros
#define _PWM5INTE_PRIE_POSN                                 0x0
#define _PWM5INTE_PRIE_POSITION                             0x0
#define _PWM5INTE_PRIE_SIZE                                 0x1
#define _PWM5INTE_PRIE_LENGTH                               0x1
#define _PWM5INTE_PRIE_MASK                                 0x1
#define _PWM5INTE_DCIE_POSN                                 0x1
#define _PWM5INTE_DCIE_POSITION                             0x1
#define _PWM5INTE_DCIE_SIZE                                 0x1
#define _PWM5INTE_DCIE_LENGTH                               0x1
#define _PWM5INTE_DCIE_MASK                                 0x2
#define _PWM5INTE_PHIE_POSN                                 0x2
#define _PWM5INTE_PHIE_POSITION                             0x2
#define _PWM5INTE_PHIE_SIZE                                 0x1
#define _PWM5INTE_PHIE_LENGTH                               0x1
#define _PWM5INTE_PHIE_MASK                                 0x4
#define _PWM5INTE_OFIE_POSN                                 0x3
#define _PWM5INTE_OFIE_POSITION                             0x3
#define _PWM5INTE_OFIE_SIZE                                 0x1
#define _PWM5INTE_OFIE_LENGTH                               0x1
#define _PWM5INTE_OFIE_MASK                                 0x8
#define _PWM5INTE_PWM5PRIE_POSN                             0x0
#define _PWM5INTE_PWM5PRIE_POSITION                         0x0
#define _PWM5INTE_PWM5PRIE_SIZE                             0x1
#define _PWM5INTE_PWM5PRIE_LENGTH                           0x1
#define _PWM5INTE_PWM5PRIE_MASK                             0x1
#define _PWM5INTE_PWM5DCIE_POSN                             0x1
#define _PWM5INTE_PWM5DCIE_POSITION                         0x1
#define _PWM5INTE_PWM5DCIE_SIZE                             0x1
#define _PWM5INTE_PWM5DCIE_LENGTH                           0x1
#define _PWM5INTE_PWM5DCIE_MASK                             0x2
#define _PWM5INTE_PWM5PHIE_POSN                             0x2
#define _PWM5INTE_PWM5PHIE_POSITION                         0x2
#define _PWM5INTE_PWM5PHIE_SIZE                             0x1
#define _PWM5INTE_PWM5PHIE_LENGTH                           0x1
#define _PWM5INTE_PWM5PHIE_MASK                             0x4
#define _PWM5INTE_PWM5OFIE_POSN                             0x3
#define _PWM5INTE_PWM5OFIE_POSITION                         0x3
#define _PWM5INTE_PWM5OFIE_SIZE                             0x1
#define _PWM5INTE_PWM5OFIE_LENGTH                           0x1
#define _PWM5INTE_PWM5OFIE_MASK                             0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned PRIE                   :1;
        unsigned DCIE                   :1;
        unsigned PHIE                   :1;
        unsigned OFIE                   :1;
    };
    struct {
        unsigned PWM5PRIE               :1;
        unsigned PWM5DCIE               :1;
        unsigned PWM5PHIE               :1;
        unsigned PWM5OFIE               :1;
    };
} PWM5INTCONbits_t;
extern volatile PWM5INTCONbits_t PWM5INTCONbits __at(0xD9C);
// bitfield macros
#define _PWM5INTCON_PRIE_POSN                               0x0
#define _PWM5INTCON_PRIE_POSITION                           0x0
#define _PWM5INTCON_PRIE_SIZE                               0x1
#define _PWM5INTCON_PRIE_LENGTH                             0x1
#define _PWM5INTCON_PRIE_MASK                               0x1
#define _PWM5INTCON_DCIE_POSN                               0x1
#define _PWM5INTCON_DCIE_POSITION                           0x1
#define _PWM5INTCON_DCIE_SIZE                               0x1
#define _PWM5INTCON_DCIE_LENGTH                             0x1
#define _PWM5INTCON_DCIE_MASK                               0x2
#define _PWM5INTCON_PHIE_POSN                               0x2
#define _PWM5INTCON_PHIE_POSITION                           0x2
#define _PWM5INTCON_PHIE_SIZE                               0x1
#define _PWM5INTCON_PHIE_LENGTH                             0x1
#define _PWM5INTCON_PHIE_MASK                               0x4
#define _PWM5INTCON_OFIE_POSN                               0x3
#define _PWM5INTCON_OFIE_POSITION                           0x3
#define _PWM5INTCON_OFIE_SIZE                               0x1
#define _PWM5INTCON_OFIE_LENGTH                             0x1
#define _PWM5INTCON_OFIE_MASK                               0x8
#define _PWM5INTCON_PWM5PRIE_POSN                           0x0
#define _PWM5INTCON_PWM5PRIE_POSITION                       0x0
#define _PWM5INTCON_PWM5PRIE_SIZE                           0x1
#define _PWM5INTCON_PWM5PRIE_LENGTH                         0x1
#define _PWM5INTCON_PWM5PRIE_MASK                           0x1
#define _PWM5INTCON_PWM5DCIE_POSN                           0x1
#define _PWM5INTCON_PWM5DCIE_POSITION                       0x1
#define _PWM5INTCON_PWM5DCIE_SIZE                           0x1
#define _PWM5INTCON_PWM5DCIE_LENGTH                         0x1
#define _PWM5INTCON_PWM5DCIE_MASK                           0x2
#define _PWM5INTCON_PWM5PHIE_POSN                           0x2
#define _PWM5INTCON_PWM5PHIE_POSITION                       0x2
#define _PWM5INTCON_PWM5PHIE_SIZE                           0x1
#define _PWM5INTCON_PWM5PHIE_LENGTH                         0x1
#define _PWM5INTCON_PWM5PHIE_MASK                           0x4
#define _PWM5INTCON_PWM5OFIE_POSN                           0x3
#define _PWM5INTCON_PWM5OFIE_POSITION                       0x3
#define _PWM5INTCON_PWM5OFIE_SIZE                           0x1
#define _PWM5INTCON_PWM5OFIE_LENGTH                         0x1
#define _PWM5INTCON_PWM5OFIE_MASK                           0x8

// Register: PWM5INTF
#define PWM5INTF PWM5INTF
extern volatile unsigned char           PWM5INTF            __at(0xD9D);
#ifndef _LIB_BUILD
asm("PWM5INTF equ 0D9Dh");
#endif
// aliases
extern volatile unsigned char           PWM5INTFLG          __at(0xD9D);
#ifndef _LIB_BUILD
asm("PWM5INTFLG equ 0D9Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRIF                   :1;
        unsigned DCIF                   :1;
        unsigned PHIF                   :1;
        unsigned OFIF                   :1;
    };
    struct {
        unsigned PWM5PRIF               :1;
        unsigned PWM5DCIF               :1;
        unsigned PWM5PHIF               :1;
        unsigned PWM5OFIF               :1;
    };
} PWM5INTFbits_t;
extern volatile PWM5INTFbits_t PWM5INTFbits __at(0xD9D);
// bitfield macros
#define _PWM5INTF_PRIF_POSN                                 0x0
#define _PWM5INTF_PRIF_POSITION                             0x0
#define _PWM5INTF_PRIF_SIZE                                 0x1
#define _PWM5INTF_PRIF_LENGTH                               0x1
#define _PWM5INTF_PRIF_MASK                                 0x1
#define _PWM5INTF_DCIF_POSN                                 0x1
#define _PWM5INTF_DCIF_POSITION                             0x1
#define _PWM5INTF_DCIF_SIZE                                 0x1
#define _PWM5INTF_DCIF_LENGTH                               0x1
#define _PWM5INTF_DCIF_MASK                                 0x2
#define _PWM5INTF_PHIF_POSN                                 0x2
#define _PWM5INTF_PHIF_POSITION                             0x2
#define _PWM5INTF_PHIF_SIZE                                 0x1
#define _PWM5INTF_PHIF_LENGTH                               0x1
#define _PWM5INTF_PHIF_MASK                                 0x4
#define _PWM5INTF_OFIF_POSN                                 0x3
#define _PWM5INTF_OFIF_POSITION                             0x3
#define _PWM5INTF_OFIF_SIZE                                 0x1
#define _PWM5INTF_OFIF_LENGTH                               0x1
#define _PWM5INTF_OFIF_MASK                                 0x8
#define _PWM5INTF_PWM5PRIF_POSN                             0x0
#define _PWM5INTF_PWM5PRIF_POSITION                         0x0
#define _PWM5INTF_PWM5PRIF_SIZE                             0x1
#define _PWM5INTF_PWM5PRIF_LENGTH                           0x1
#define _PWM5INTF_PWM5PRIF_MASK                             0x1
#define _PWM5INTF_PWM5DCIF_POSN                             0x1
#define _PWM5INTF_PWM5DCIF_POSITION                         0x1
#define _PWM5INTF_PWM5DCIF_SIZE                             0x1
#define _PWM5INTF_PWM5DCIF_LENGTH                           0x1
#define _PWM5INTF_PWM5DCIF_MASK                             0x2
#define _PWM5INTF_PWM5PHIF_POSN                             0x2
#define _PWM5INTF_PWM5PHIF_POSITION                         0x2
#define _PWM5INTF_PWM5PHIF_SIZE                             0x1
#define _PWM5INTF_PWM5PHIF_LENGTH                           0x1
#define _PWM5INTF_PWM5PHIF_MASK                             0x4
#define _PWM5INTF_PWM5OFIF_POSN                             0x3
#define _PWM5INTF_PWM5OFIF_POSITION                         0x3
#define _PWM5INTF_PWM5OFIF_SIZE                             0x1
#define _PWM5INTF_PWM5OFIF_LENGTH                           0x1
#define _PWM5INTF_PWM5OFIF_MASK                             0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned PRIF                   :1;
        unsigned DCIF                   :1;
        unsigned PHIF                   :1;
        unsigned OFIF                   :1;
    };
    struct {
        unsigned PWM5PRIF               :1;
        unsigned PWM5DCIF               :1;
        unsigned PWM5PHIF               :1;
        unsigned PWM5OFIF               :1;
    };
} PWM5INTFLGbits_t;
