MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1768/mcu.h
// Register: PWM6TMRL
#define PWM6TMRL PWM6TMRL
extern volatile unsigned char           PWM6TMRL            __at(0xDA9);
#ifndef _LIB_BUILD
asm("PWM6TMRL equ 0DA9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned PWM6TMRL0              :1;
        unsigned PWM6TMRL1              :1;
        unsigned PWM6TMRL2              :1;
        unsigned PWM6TMRL3              :1;
        unsigned PWM6TMRL4              :1;
        unsigned PWM6TMRL5              :1;
        unsigned PWM6TMRL6              :1;
        unsigned PWM6TMRL7              :1;
    };
    struct {
        unsigned PWM6TMRL               :8;
    };
} PWM6TMRLbits_t;
extern volatile PWM6TMRLbits_t PWM6TMRLbits __at(0xDA9);
// bitfield macros
#define _PWM6TMRL_TMR_POSN                                  0x0
#define _PWM6TMRL_TMR_POSITION                              0x0
#define _PWM6TMRL_TMR_SIZE                                  0x8
#define _PWM6TMRL_TMR_LENGTH                                0x8
#define _PWM6TMRL_TMR_MASK                                  0xFF
#define _PWM6TMRL_PWM6TMRL0_POSN                            0x0
#define _PWM6TMRL_PWM6TMRL0_POSITION                        0x0
#define _PWM6TMRL_PWM6TMRL0_SIZE                            0x1
#define _PWM6TMRL_PWM6TMRL0_LENGTH                          0x1
#define _PWM6TMRL_PWM6TMRL0_MASK                            0x1
#define _PWM6TMRL_PWM6TMRL1_POSN                            0x1
#define _PWM6TMRL_PWM6TMRL1_POSITION                        0x1
#define _PWM6TMRL_PWM6TMRL1_SIZE                            0x1
#define _PWM6TMRL_PWM6TMRL1_LENGTH                          0x1
#define _PWM6TMRL_PWM6TMRL1_MASK                            0x2
#define _PWM6TMRL_PWM6TMRL2_POSN                            0x2
#define _PWM6TMRL_PWM6TMRL2_POSITION                        0x2
#define _PWM6TMRL_PWM6TMRL2_SIZE                            0x1
#define _PWM6TMRL_PWM6TMRL2_LENGTH                          0x1
#define _PWM6TMRL_PWM6TMRL2_MASK                            0x4
#define _PWM6TMRL_PWM6TMRL3_POSN                            0x3
#define _PWM6TMRL_PWM6TMRL3_POSITION                        0x3
#define _PWM6TMRL_PWM6TMRL3_SIZE                            0x1
#define _PWM6TMRL_PWM6TMRL3_LENGTH                          0x1
#define _PWM6TMRL_PWM6TMRL3_MASK                            0x8
#define _PWM6TMRL_PWM6TMRL4_POSN                            0x4
#define _PWM6TMRL_PWM6TMRL4_POSITION                        0x4
#define _PWM6TMRL_PWM6TMRL4_SIZE                            0x1
#define _PWM6TMRL_PWM6TMRL4_LENGTH                          0x1
#define _PWM6TMRL_PWM6TMRL4_MASK                            0x10
#define _PWM6TMRL_PWM6TMRL5_POSN                            0x5
#define _PWM6TMRL_PWM6TMRL5_POSITION                        0x5
#define _PWM6TMRL_PWM6TMRL5_SIZE                            0x1
#define _PWM6TMRL_PWM6TMRL5_LENGTH                          0x1
#define _PWM6TMRL_PWM6TMRL5_MASK                            0x20
#define _PWM6TMRL_PWM6TMRL6_POSN                            0x6
#define _PWM6TMRL_PWM6TMRL6_POSITION                        0x6
#define _PWM6TMRL_PWM6TMRL6_SIZE                            0x1
#define _PWM6TMRL_PWM6TMRL6_LENGTH                          0x1
#define _PWM6TMRL_PWM6TMRL6_MASK                            0x40
#define _PWM6TMRL_PWM6TMRL7_POSN                            0x7
#define _PWM6TMRL_PWM6TMRL7_POSITION                        0x7
#define _PWM6TMRL_PWM6TMRL7_SIZE                            0x1
#define _PWM6TMRL_PWM6TMRL7_LENGTH                          0x1
#define _PWM6TMRL_PWM6TMRL7_MASK                            0x80
#define _PWM6TMRL_PWM6TMRL_POSN                             0x0
#define _PWM6TMRL_PWM6TMRL_POSITION                         0x0
#define _PWM6TMRL_PWM6TMRL_SIZE                             0x8
#define _PWM6TMRL_PWM6TMRL_LENGTH                           0x8
#define _PWM6TMRL_PWM6TMRL_MASK                             0xFF

// Register: PWM6TMRH
#define PWM6TMRH PWM6TMRH
extern volatile unsigned char           PWM6TMRH            __at(0xDAA);
#ifndef _LIB_BUILD
asm("PWM6TMRH equ 0DAAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned PWM6TMRH0              :1;
        unsigned PWM6TMRH1              :1;
        unsigned PWM6TMRH2              :1;
        unsigned PWM6TMRH3              :1;
        unsigned PWM6TMRH4              :1;
        unsigned PWM6TMRH5              :1;
        unsigned PWM6TMRH6              :1;
        unsigned PWM6TMRH7              :1;
    };
    struct {
        unsigned PWM6TMRH               :8;
    };
} PWM6TMRHbits_t;
extern volatile PWM6TMRHbits_t PWM6TMRHbits __at(0xDAA);
// bitfield macros
#define _PWM6TMRH_TMR_POSN                                  0x0
#define _PWM6TMRH_TMR_POSITION                              0x0
#define _PWM6TMRH_TMR_SIZE                                  0x8
#define _PWM6TMRH_TMR_LENGTH                                0x8
#define _PWM6TMRH_TMR_MASK                                  0xFF
#define _PWM6TMRH_PWM6TMRH0_POSN                            0x0
#define _PWM6TMRH_PWM6TMRH0_POSITION                        0x0
#define _PWM6TMRH_PWM6TMRH0_SIZE                            0x1
#define _PWM6TMRH_PWM6TMRH0_LENGTH                          0x1
#define _PWM6TMRH_PWM6TMRH0_MASK                            0x1
#define _PWM6TMRH_PWM6TMRH1_POSN                            0x1
#define _PWM6TMRH_PWM6TMRH1_POSITION                        0x1
#define _PWM6TMRH_PWM6TMRH1_SIZE                            0x1
#define _PWM6TMRH_PWM6TMRH1_LENGTH                          0x1
#define _PWM6TMRH_PWM6TMRH1_MASK                            0x2
#define _PWM6TMRH_PWM6TMRH2_POSN                            0x2
#define _PWM6TMRH_PWM6TMRH2_POSITION                        0x2
#define _PWM6TMRH_PWM6TMRH2_SIZE                            0x1
#define _PWM6TMRH_PWM6TMRH2_LENGTH                          0x1
#define _PWM6TMRH_PWM6TMRH2_MASK                            0x4
#define _PWM6TMRH_PWM6TMRH3_POSN                            0x3
#define _PWM6TMRH_PWM6TMRH3_POSITION                        0x3
#define _PWM6TMRH_PWM6TMRH3_SIZE                            0x1
#define _PWM6TMRH_PWM6TMRH3_LENGTH                          0x1
#define _PWM6TMRH_PWM6TMRH3_MASK                            0x8
#define _PWM6TMRH_PWM6TMRH4_POSN                            0x4
#define _PWM6TMRH_PWM6TMRH4_POSITION                        0x4
#define _PWM6TMRH_PWM6TMRH4_SIZE                            0x1
#define _PWM6TMRH_PWM6TMRH4_LENGTH                          0x1
#define _PWM6TMRH_PWM6TMRH4_MASK                            0x10
#define _PWM6TMRH_PWM6TMRH5_POSN                            0x5
#define _PWM6TMRH_PWM6TMRH5_POSITION                        0x5
#define _PWM6TMRH_PWM6TMRH5_SIZE                            0x1
#define _PWM6TMRH_PWM6TMRH5_LENGTH                          0x1
#define _PWM6TMRH_PWM6TMRH5_MASK                            0x20
#define _PWM6TMRH_PWM6TMRH6_POSN                            0x6
#define _PWM6TMRH_PWM6TMRH6_POSITION                        0x6
#define _PWM6TMRH_PWM6TMRH6_SIZE                            0x1
#define _PWM6TMRH_PWM6TMRH6_LENGTH                          0x1
#define _PWM6TMRH_PWM6TMRH6_MASK                            0x40
#define _PWM6TMRH_PWM6TMRH7_POSN                            0x7
#define _PWM6TMRH_PWM6TMRH7_POSITION                        0x7
#define _PWM6TMRH_PWM6TMRH7_SIZE                            0x1
#define _PWM6TMRH_PWM6TMRH7_LENGTH                          0x1
#define _PWM6TMRH_PWM6TMRH7_MASK                            0x80
#define _PWM6TMRH_PWM6TMRH_POSN                             0x0
#define _PWM6TMRH_PWM6TMRH_POSITION                         0x0
#define _PWM6TMRH_PWM6TMRH_SIZE                             0x8
#define _PWM6TMRH_PWM6TMRH_LENGTH                           0x8
#define _PWM6TMRH_PWM6TMRH_MASK                             0xFF

// Register: PWM6CON
#define PWM6CON PWM6CON
extern volatile unsigned char           PWM6CON             __at(0xDAB);
#ifndef _LIB_BUILD
asm("PWM6CON equ 0DABh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned MODE                   :2;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :2;
        unsigned PWM6MODE0              :1;
        unsigned PWM6MODE1              :1;
    };
    struct {
        unsigned                        :2;
        unsigned PWM6MODE               :2;
        unsigned PWM6POL                :1;
        unsigned PWM6OUT                :1;
        unsigned                        :1;
        unsigned PWM6EN                 :1;
    };
    struct {
        unsigned                        :2;
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
    };
} PWM6CONbits_t;
extern volatile PWM6CONbits_t PWM6CONbits __at(0xDAB);
// bitfield macros
#define _PWM6CON_MODE_POSN                                  0x2
#define _PWM6CON_MODE_POSITION                              0x2
#define _PWM6CON_MODE_SIZE                                  0x2
#define _PWM6CON_MODE_LENGTH                                0x2
#define _PWM6CON_MODE_MASK                                  0xC
#define _PWM6CON_POL_POSN                                   0x4
#define _PWM6CON_POL_POSITION                               0x4
#define _PWM6CON_POL_SIZE                                   0x1
#define _PWM6CON_POL_LENGTH                                 0x1
#define _PWM6CON_POL_MASK                                   0x10
#define _PWM6CON_OUT_POSN                                   0x5
#define _PWM6CON_OUT_POSITION                               0x5
#define _PWM6CON_OUT_SIZE                                   0x1
#define _PWM6CON_OUT_LENGTH                                 0x1
#define _PWM6CON_OUT_MASK                                   0x20
#define _PWM6CON_EN_POSN                                    0x7
#define _PWM6CON_EN_POSITION                                0x7
#define _PWM6CON_EN_SIZE                                    0x1
#define _PWM6CON_EN_LENGTH                                  0x1
#define _PWM6CON_EN_MASK                                    0x80
#define _PWM6CON_PWM6MODE0_POSN                             0x2
#define _PWM6CON_PWM6MODE0_POSITION                         0x2
#define _PWM6CON_PWM6MODE0_SIZE                             0x1
#define _PWM6CON_PWM6MODE0_LENGTH                           0x1
#define _PWM6CON_PWM6MODE0_MASK                             0x4
#define _PWM6CON_PWM6MODE1_POSN                             0x3
#define _PWM6CON_PWM6MODE1_POSITION                         0x3
#define _PWM6CON_PWM6MODE1_SIZE                             0x1
#define _PWM6CON_PWM6MODE1_LENGTH                           0x1
#define _PWM6CON_PWM6MODE1_MASK                             0x8
#define _PWM6CON_PWM6MODE_POSN                              0x2
#define _PWM6CON_PWM6MODE_POSITION                          0x2
#define _PWM6CON_PWM6MODE_SIZE                              0x2
#define _PWM6CON_PWM6MODE_LENGTH                            0x2
#define _PWM6CON_PWM6MODE_MASK                              0xC
#define _PWM6CON_PWM6POL_POSN                               0x4
#define _PWM6CON_PWM6POL_POSITION                           0x4
#define _PWM6CON_PWM6POL_SIZE                               0x1
#define _PWM6CON_PWM6POL_LENGTH                             0x1
#define _PWM6CON_PWM6POL_MASK                               0x10
#define _PWM6CON_PWM6OUT_POSN                               0x5
#define _PWM6CON_PWM6OUT_POSITION                           0x5
#define _PWM6CON_PWM6OUT_SIZE                               0x1
#define _PWM6CON_PWM6OUT_LENGTH                             0x1
#define _PWM6CON_PWM6OUT_MASK                               0x20
#define _PWM6CON_PWM6EN_POSN                                0x7
#define _PWM6CON_PWM6EN_POSITION                            0x7
#define _PWM6CON_PWM6EN_SIZE                                0x1
#define _PWM6CON_PWM6EN_LENGTH                              0x1
#define _PWM6CON_PWM6EN_MASK                                0x80
#define _PWM6CON_MODE0_POSN                                 0x2
#define _PWM6CON_MODE0_POSITION                             0x2
#define _PWM6CON_MODE0_SIZE                                 0x1
#define _PWM6CON_MODE0_LENGTH                               0x1
#define _PWM6CON_MODE0_MASK                                 0x4
#define _PWM6CON_MODE1_POSN                                 0x3
#define _PWM6CON_MODE1_POSITION                             0x3
#define _PWM6CON_MODE1_SIZE                                 0x1
#define _PWM6CON_MODE1_LENGTH                               0x1
#define _PWM6CON_MODE1_MASK                                 0x8

// Register: PWM6INTE
#define PWM6INTE PWM6INTE
extern volatile unsigned char           PWM6INTE            __at(0xDAC);
#ifndef _LIB_BUILD
asm("PWM6INTE equ 0DACh");
#endif
// aliases
extern volatile unsigned char           PWM6INTCON          __at(0xDAC);
#ifndef _LIB_BUILD
asm("PWM6INTCON equ 0DACh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRIE                   :1;
        unsigned DCIE                   :1;
        unsigned PHIE                   :1;
        unsigned OFIE                   :1;
    };
    struct {
        unsigned PWM6PRIE               :1;
        unsigned PWM6DCIE               :1;
        unsigned PWM6PHIE               :1;
        unsigned PWM6OFIE               :1;
    };
} PWM6INTEbits_t;
extern volatile PWM6INTEbits_t PWM6INTEbits __at(0xDAC);
// bitfield macros
#define _PWM6INTE_PRIE_POSN                                 0x0
#define _PWM6INTE_PRIE_POSITION                             0x0
#define _PWM6INTE_PRIE_SIZE                                 0x1
#define _PWM6INTE_PRIE_LENGTH                               0x1
#define _PWM6INTE_PRIE_MASK                                 0x1
#define _PWM6INTE_DCIE_POSN                                 0x1
#define _PWM6INTE_DCIE_POSITION                             0x1
#define _PWM6INTE_DCIE_SIZE                                 0x1
#define _PWM6INTE_DCIE_LENGTH                               0x1
#define _PWM6INTE_DCIE_MASK                                 0x2
#define _PWM6INTE_PHIE_POSN                                 0x2
#define _PWM6INTE_PHIE_POSITION                             0x2
#define _PWM6INTE_PHIE_SIZE                                 0x1
#define _PWM6INTE_PHIE_LENGTH                               0x1
#define _PWM6INTE_PHIE_MASK                                 0x4
#define _PWM6INTE_OFIE_POSN                                 0x3
#define _PWM6INTE_OFIE_POSITION                             0x3
#define _PWM6INTE_OFIE_SIZE                                 0x1
#define _PWM6INTE_OFIE_LENGTH                               0x1
#define _PWM6INTE_OFIE_MASK                                 0x8
#define _PWM6INTE_PWM6PRIE_POSN                             0x0
#define _PWM6INTE_PWM6PRIE_POSITION                         0x0
#define _PWM6INTE_PWM6PRIE_SIZE                             0x1
#define _PWM6INTE_PWM6PRIE_LENGTH                           0x1
#define _PWM6INTE_PWM6PRIE_MASK                             0x1
#define _PWM6INTE_PWM6DCIE_POSN                             0x1
#define _PWM6INTE_PWM6DCIE_POSITION                         0x1
#define _PWM6INTE_PWM6DCIE_SIZE                             0x1
#define _PWM6INTE_PWM6DCIE_LENGTH                           0x1
#define _PWM6INTE_PWM6DCIE_MASK                             0x2
#define _PWM6INTE_PWM6PHIE_POSN                             0x2
#define _PWM6INTE_PWM6PHIE_POSITION                         0x2
#define _PWM6INTE_PWM6PHIE_SIZE                             0x1
#define _PWM6INTE_PWM6PHIE_LENGTH                           0x1
#define _PWM6INTE_PWM6PHIE_MASK                             0x4
#define _PWM6INTE_PWM6OFIE_POSN                             0x3
#define _PWM6INTE_PWM6OFIE_POSITION                         0x3
#define _PWM6INTE_PWM6OFIE_SIZE                             0x1
#define _PWM6INTE_PWM6OFIE_LENGTH                           0x1
#define _PWM6INTE_PWM6OFIE_MASK                             0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned PRIE                   :1;
        unsigned DCIE                   :1;
        unsigned PHIE                   :1;
        unsigned OFIE                   :1;
    };
    struct {
        unsigned PWM6PRIE               :1;
        unsigned PWM6DCIE               :1;
        unsigned PWM6PHIE               :1;
        unsigned PWM6OFIE               :1;
    };
} PWM6INTCONbits_t;
extern volatile PWM6INTCONbits_t PWM6INTCONbits __at(0xDAC);
// bitfield macros
#define _PWM6INTCON_PRIE_POSN                               0x0
#define _PWM6INTCON_PRIE_POSITION                           0x0
#define _PWM6INTCON_PRIE_SIZE                               0x1
#define _PWM6INTCON_PRIE_LENGTH                             0x1
#define _PWM6INTCON_PRIE_MASK                               0x1
#define _PWM6INTCON_DCIE_POSN                               0x1
#define _PWM6INTCON_DCIE_POSITION                           0x1
#define _PWM6INTCON_DCIE_SIZE                               0x1
#define _PWM6INTCON_DCIE_LENGTH                             0x1
#define _PWM6INTCON_DCIE_MASK                               0x2
#define _PWM6INTCON_PHIE_POSN                               0x2
#define _PWM6INTCON_PHIE_POSITION                           0x2
#define _PWM6INTCON_PHIE_SIZE                               0x1
#define _PWM6INTCON_PHIE_LENGTH                             0x1
#define _PWM6INTCON_PHIE_MASK                               0x4
#define _PWM6INTCON_OFIE_POSN                               0x3
#define _PWM6INTCON_OFIE_POSITION                           0x3
#define _PWM6INTCON_OFIE_SIZE                               0x1
#define _PWM6INTCON_OFIE_LENGTH                             0x1
#define _PWM6INTCON_OFIE_MASK                               0x8
#define _PWM6INTCON_PWM6PRIE_POSN                           0x0
#define _PWM6INTCON_PWM6PRIE_POSITION                       0x0
#define _PWM6INTCON_PWM6PRIE_SIZE                           0x1
#define _PWM6INTCON_PWM6PRIE_LENGTH                         0x1
#define _PWM6INTCON_PWM6PRIE_MASK                           0x1
#define _PWM6INTCON_PWM6DCIE_POSN                           0x1
#define _PWM6INTCON_PWM6DCIE_POSITION                       0x1
#define _PWM6INTCON_PWM6DCIE_SIZE                           0x1
#define _PWM6INTCON_PWM6DCIE_LENGTH                         0x1
#define _PWM6INTCON_PWM6DCIE_MASK                           0x2
#define _PWM6INTCON_PWM6PHIE_POSN                           0x2
#define _PWM6INTCON_PWM6PHIE_POSITION                       0x2
#define _PWM6INTCON_PWM6PHIE_SIZE                           0x1
#define _PWM6INTCON_PWM6PHIE_LENGTH                         0x1
#define _PWM6INTCON_PWM6PHIE_MASK                           0x4
#define _PWM6INTCON_PWM6OFIE_POSN                           0x3
#define _PWM6INTCON_PWM6OFIE_POSITION                       0x3
#define _PWM6INTCON_PWM6OFIE_SIZE                           0x1
#define _PWM6INTCON_PWM6OFIE_LENGTH                         0x1
#define _PWM6INTCON_PWM6OFIE_MASK                           0x8

// Register: PWM6INTF
#define PWM6INTF PWM6INTF
extern volatile unsigned char           PWM6INTF            __at(0xDAD);
#ifndef _LIB_BUILD
asm("PWM6INTF equ 0DADh");
#endif
// aliases
extern volatile unsigned char           PWM6INTFLG          __at(0xDAD);
#ifndef _LIB_BUILD
asm("PWM6INTFLG equ 0DADh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRIF                   :1;
        unsigned DCIF                   :1;
        unsigned PHIF                   :1;
        unsigned OFIF                   :1;
    };
    struct {
        unsigned PWM6PRIF               :1;
        unsigned PWM6DCIF               :1;
        unsigned PWM6PHIF               :1;
        unsigned PWM6OFIF               :1;
    };
} PWM6INTFbits_t;
